public class Main {
    public static void main(String[] args)  {
//        UravBalance.prepareUrBal();
//        UravBalance.createUrBal();
//        KPR.parseAndCreateKPR();
//        CorrectUV.createCorrectUvOG("Кор_Ш_Сев_ПО58","Шунт_Север", "Север_ПомимоКПР_Выведен", "Север_ПомимоКПР_Введен","100");
//        CorrectUV.createCorrectUvOnRE("Кор_Ш_Фрол+Б3+Б4_ПО47"
//                ,"Шунт_Фроловское+Бл-3+Бл-4"
//                , "Фрол-е+Б3+Б4_ПомимоКПР_Вывед"
//                , "Фрол-е+Б3+Б4_ПомимоКПР_Введен"
//                ,"500");
//        CorrectUV.createCorrectUvOnKE("Кор_Ш_Фрол+Б3+Б4_ПО47"
//                ,"Шунт_Фроловское+Бл-3+Бл-4"
//                , "Фрол-е+Б3+Б4_ПомимоКПР_Вывед"
//                , "Фрол-е+Б3+Б4_ПомимоКПР_Введен"
//                ,"500");
//        CorrectUV.createCorrectUvOnBH("Кор_Ш_Фрол+Б3+Б4_ПО47"
//                ,"Шунт_Фроловское+Бл-3+Бл-4"
//                , "Фрол-е+Б3+Б4_ПомимоКПР_Вывед"
//                , "Фрол-е+Б3+Б4_ПомимоКПР_Введен"
//                ,"500");
        CorrectUV.createCorrectUvOnKP("Кор_Ш_Фрол+Б3+Б4_ПО47"
                ,"Шунт_Фроловское+Бл-3+Бл-4"
                , "Фрол-е+Б3+Б4_ПомимоКПР_Вывед"
                , "Фрол-е+Б3+Б4_ПомимоКПР_Введен"
                ,"500");

    }
}
