import org.apache.poi.ss.usermodel.Row;
import org.apache.poi.ss.usermodel.Sheet;
import org.apache.poi.ss.usermodel.Workbook;
import org.apache.poi.xssf.usermodel.XSSFWorkbook;

import java.io.FileInputStream;
import java.io.IOException;
import java.util.ArrayList;
import java.util.TreeMap;


public class ParseExcelTableShunt {

    protected static ArrayList<String> parseExcelTableShunt() throws IOException {
        FileInputStream fis = new FileInputStream("data/Shunt.xlsx");

        Workbook workbook;
        try {
            workbook = new XSSFWorkbook(
                    fis);
        } catch (IOException e) {
            throw new RuntimeException(e);
        }
        ArrayList<String> shuntTable = new ArrayList<>();
        ArrayList<Sheet> sheets = new ArrayList<>();
        int count = workbook.getNumberOfSheets();
        for (int i = 0; i < count; i++) {
            sheets.add(workbook.getSheetAt(i));
        }
        for (Sheet list : sheets) {

            String schemesKpr = list.getRow(0).getCell(0).getStringCellValue();
            System.out.println(schemesKpr);
            String schemeGroup = getMapGroup(schemesKpr);
            System.out.println(schemesKpr);
            for (Row row : list) {
                String cellValue = Integer.toString((int)row.getCell(1).getNumericCellValue());
                shuntTable.add(createTableShuntString(schemeGroup, cellValue));
            }
        }
        fis.close();
        return shuntTable;
    }
    public static String getMapGroup(String schemesKpr){
        String schemesGroup = "";
        if (schemesKpr.contains("«Шунтировка Волгоград-Ростов»")) {
            schemesGroup = "{ВР}";
        } else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 1»")) {
            schemesGroup = "{ВР_БЛ1}";
        } else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 2»")) {
            schemesGroup = "{ВР_БЛ2}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 3»")) {
            schemesGroup = "{ВР_БЛ3}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 4»")) {
            schemesGroup = "{ВР_БЛ4}";
        }else if (schemesKpr.contains("«Шунтировка Ростов-Волгоград»")) {
            schemesGroup = "{РВ}";
        }else if (schemesKpr.contains("«Шунтировка Ростов- Волгоград-+ВЛ 500 кВ Победа – Шахты»")) {
            schemesGroup = "{РВ_ПШ}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 1»")) {
            schemesGroup = "{В_БЛ1}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 2»")) {
            schemesGroup = "{В_БЛ2}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское +Блок 3»")) {
            schemesGroup = "{В_БЛ3}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское +Блок 4»")) {
            schemesGroup = "{В_БЛ4}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 1»")) {
            schemesGroup = "{Ф_БЛ1}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 2»")) {
            schemesGroup = "{Ф_БЛ2}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 3»")) {
            schemesGroup = "{Ф_БЛ3}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 4»")) {
            schemesGroup = "{Ф_БЛ4}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское из ОЭС Юга+ ВЛ 500 кВ Победа – Шахты»")) {
            schemesGroup = "{В_ПШ}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское из ОЭС Юга+ ВЛ 500 кВ Победа – Шахты»")) {
            schemesGroup = "{Ф_ПШ}";
        }else if (schemesKpr.contains("«Шунтировка Север»")) {
            schemesGroup = "{С}";
        }else if (schemesKpr.contains("«Шунтировка Шахты»")) {
            schemesGroup = "{Ш}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 1+Блок 2»")) {
            schemesGroup = "{ВР_БЛ12}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 1+Блок 3»")) {
            schemesGroup = "{ВР_БЛ13}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 1+Блок 4»")) {
            schemesGroup = "{ВР_БЛ14}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 2+Блок 3»")) {
            schemesGroup = "{ВР_БЛ23}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 2+Блок 4»")) {
            schemesGroup = "{ВР_БЛ24}";
        }else if (schemesKpr.contains("«Шунтировка Волгоград-Ростов+Блок 3+Блок 4»")) {
            schemesGroup = "{ВР_БЛ34}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 1+Блок 2»")) {
            schemesGroup = "{В_БЛ12}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 1+Блок 3»")) {
            schemesGroup = "{В_БЛ13}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 2+Блок 3»")) {
            schemesGroup = "{В_БЛ23}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 1+Блок 4»")) {
            schemesGroup = "{В_БЛ14}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 2+Блок 4»")) {
            schemesGroup = "{В_БЛ24}";
        }else if (schemesKpr.contains("«Шунтировка Волгоградское+Блок 3+Блок 4»")) {
            schemesGroup = "{В_БЛ34}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 1+Блок 2»")) {
            schemesGroup = "{Ф_БЛ12}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 1+Блок 3»")) {
            schemesGroup = "{Ф_БЛ13}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 2+Блок 3»")) {
            schemesGroup = "{Ф_БЛ23}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 1+Блок 4»")) {
            schemesGroup = "{Ф_БЛ14}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 2+Блок 4»")) {
            schemesGroup = "{Ф_БЛ24}";
        }else if (schemesKpr.contains("«Шунтировка Фроловское +Блок 3+Блок 4»")) {
            schemesGroup = "{Ф_БЛ34}";
        }
        return schemesGroup;
    }
    public static TreeMap<String, String> getMapTs(String scheme){
        TreeMap<String, String> mapFormTs = new TreeMap<>();
        switch (scheme) {
            case "{ВР}":
                mapFormTs.put("3", "Шунт_Волг-Рост_Введ_ПО3");
                mapFormTs.put("12", "Шунт_Волг-Рост_Введ_ПО12");
                mapFormTs.put("4", "Шунт_Волг-Рост_Введ_ПО4");
                mapFormTs.put("18", "Шунт_Волг-Рост_Введ_ПО6_и_Р12");
                mapFormTs.put("24", "Шунт_Волг-Рост_Введ_ПО8_и_Р90");
                mapFormTs.put("36", "Шунт_Волг-Рост_Введ_ПО36");
                mapFormTs.put("37", "Шунт_Волг-Рост_Введ_ПО37");
                mapFormTs.put("38", "Шунт_Волг-Рост_Введ_ПО38");
                mapFormTs.put("39", "Шунт_Волг-Рост_Введ_ПО39");
                mapFormTs.put("40", "Шунт_Волг-Рост_Введ_ПО40");
                mapFormTs.put("27", "Шунт_Волг-Рост_Введ_ПО27");
                mapFormTs.put("28", "Шунт_Волг-Рост_Введ_ПО28");
                mapFormTs.put("29", "Шунт_Волг-Рост_Введ_ПО29");
                mapFormTs.put("41", "Шунт_Волг-Рост_Введ_ПО41");
                mapFormTs.put("30", "Шунт_Волг-Рост_Введ_ПО30");
                mapFormTs.put("31", "Шунт_Волг-Рост_Введ_ПО31");
                mapFormTs.put("32", "Шунт_Волг-Рост_Введ_ПО32");
                mapFormTs.put("33", "Шунт_Волг-Рост_Введ_ПО33");
                mapFormTs.put("34", "Шунт_Волг-Рост_Введ_ПО34");
                mapFormTs.put("35", "Шунт_Волг-Рост_Введ_ПО35");
                mapFormTs.put("6", "Шунт_Волг-Рост_Введ_ПО6");
                mapFormTs.put("8", "Шунт_Волг-Рост_Введ_ПО8");
                break;
            case "{РВ}":
                mapFormTs.put("3", "Шунт_Рост-Волг_Введ_ПО3");
                mapFormTs.put("12", "Шунт_Рост-Волг_Введ_ПО12");
                mapFormTs.put("4", "Шунт_Рост-Волг_Введ_ПО4");
                mapFormTs.put("18", "Шунт_Рост-Волг_Введ_ПО6_и_Р12");
                mapFormTs.put("24", "Шунт_Рост-Волг_Введ_ПО8_и_Р90");
                mapFormTs.put("26", "Шунт_Рост-Волг_Введ_ПО1_и_Р6");
                mapFormTs.put("25", "Шунт_Рост-Волг_Введ_ПО14_и_Р1");
                mapFormTs.put("36", "Шунт_Рост-Волг_Введ_ПО36");
                mapFormTs.put("37", "Шунт_Рост-Волг_Введ_ПО37");
                mapFormTs.put("38", "Шунт_Рост-Волг_Введ_ПО38");
                mapFormTs.put("39", "Шунт_Рост-Волг_Введ_ПО39");
                mapFormTs.put("40", "Шунт_Рост-Волг_Введ_ПО40");
                mapFormTs.put("27", "Шунт_Рост-Волг_Введ_ПО27");
                mapFormTs.put("28", "Шунт_Рост-Волг_Введ_ПО28");
                mapFormTs.put("29", "Шунт_Рост-Волг_Введ_ПО29");
                mapFormTs.put("41", "Шунт_Рост-Волг_Введ_ПО41");
                mapFormTs.put("30", "Шунт_Рост-Волг_Введ_ПО30");
                mapFormTs.put("31", "Шунт_Рост-Волг_Введ_ПО31");
                mapFormTs.put("32", "Шунт_Рост-Волг_Введ_ПО32");
                mapFormTs.put("33", "Шунт_Рост-Волг_Введ_ПО33");
                mapFormTs.put("34", "Шунт_Рост-Волг_Введ_ПО34");
                mapFormTs.put("35", "Шунт_Рост-Волг_Введ_ПО35");
                mapFormTs.put("6", "Шунт_Рост-Волг_Введ_ПО6");
                mapFormTs.put("8", "Шунт_Рост-Волг_Введ_ПО8");
                break;
            case "{ВР_БЛ1}":
                mapFormTs.put("11", "Шунт_Волг-Рост+Б1_Введ_ПО11");
                mapFormTs.put("48", "Шунт_Волг-Рост+Б1_Введ_ПО48");
                break;
            case "{ВР_БЛ2}":
                mapFormTs.put("20", "Шунт_Волг-Рост+Б2_Введ_ПО20");
                mapFormTs.put("49", "Шунт_Волг-Рост+Б2_Введ_ПО49");
                break;
            case "{ВР_БЛ3}":
                mapFormTs.put("22", "Шунт_Волг-Рост+Б3_Введ_ПО22");
                mapFormTs.put("50", "Шунт_Волг-Рост+Б3_Введ_ПО50");
                mapFormTs.put("51", "Шунт_Волг-Рост+Б3_Введ_ПО51");
                break;
            case "{ВР_БЛ4}":
                mapFormTs.put("23", "Шунт_Волг-Рост+Б4_Введ_ПО23");
                mapFormTs.put("52", "Шунт_Волг-Рост+Б4_Введ_ПО52");
                mapFormTs.put("53", "Шунт_Волг-Рост+Б4_Введ_ПО53");
                break;
            case "{РВ_ПШ}":
                mapFormTs.put("5", "Шунт_Рост-Волг+П-Ш_Введ_ПО5");
                mapFormTs.put("29", "Шунт_Рост-Волг+П-Ш_Введ_ПО29");
                break;
            case "{В_БЛ1}":
                mapFormTs.put("11", "Шунт_Волг-е+Б1_Введ_ПО11");
                break;
            case "{В_БЛ2}":
                mapFormTs.put("20", "Шунт_Волг-е+Б2_Введ_ПО20");
                break;
            case "{В_БЛ3}":
                mapFormTs.put("22", "Шунт_Волг-е+Б3_Введ_ПО22");
                break;
            case "{В_БЛ4}":
                mapFormTs.put("23", "Шунт_Волг-е+Б4_Введ_ПО23");
                break;
            case "{Ф_БЛ1}":
                mapFormTs.put("11", "Шунт_Фрол-е+Б1_Введ_ПО11");
                break;
            case "{Ф_БЛ2}":
                mapFormTs.put("20", "Шунт_Фрол-е+Б2_Введ_ПО20");
                break;
            case "{Ф_БЛ3}":
                mapFormTs.put("22", "Шунт_Фрол-е+Б3_Введ_ПО22");
                break;
            case "{Ф_БЛ4}":
                mapFormTs.put("23", "Шунт_Фрол-е+Б4_Введ_ПО23");
                break;
            case "{В_ПШ}":
                mapFormTs.put("5", "Шунт_Волг-е_изЭСЮга+ПШ_Введ_ПО5");
                break;
            case "{Ф_ПШ}":
                mapFormTs.put("5", "Шунт_Фрол-е_изЭСЮга+ПШ_Введ_ПО5");
                break;
            case "{С}":
                mapFormTs.put("3", "Шунт_Север_Введ_ПО3");
                mapFormTs.put("2", "Шунт_Север_Введ_ПО2");
                mapFormTs.put("1", "Шунт_Север_Введ_ПО1");
                mapFormTs.put("12", "Шунт_Север_Введ_ПО12");
                mapFormTs.put("10", "Шунт_Север_Введ_ПО10");
                mapFormTs.put("27", "Шунт_Север_Введ_ПО27");
                mapFormTs.put("28", "Шунт_Север_Введ_ПО28");
                mapFormTs.put("7", "Шунт_Север_Введ_ПО7");
                mapFormTs.put("13", "Шунт_Север_Введ_ПО13");
                mapFormTs.put("56", "Шунт_Север_Введ_ПО56");
                mapFormTs.put("57", "Шунт_Север_Введ_ПО57");
                mapFormTs.put("58", "Шунт_Север_Введ_ПО58");
                break;
            case "{Ш}":
                mapFormTs.put("13", "Шунт_Шахты_Введ_ПО13");
                mapFormTs.put("2", "Шунт_Шахты_Введ_ПО2");
                mapFormTs.put("1", "Шунт_Шахты_Введ_ПО1");
                mapFormTs.put("4", "Шунт_Шахты_Введ_ПО4");
                mapFormTs.put("7", "Шунт_Шахты_Введ_ПО7");
                mapFormTs.put("14", "Шунт_Шахты_Введ_ПО14");
                mapFormTs.put("17", "Шунт_Шахты_Введ_ПО17");
                mapFormTs.put("40", "Шунт_Шахты_Введ_ПО40");
                mapFormTs.put("27", "Шунт_Шахты_Введ_ПО27");
                mapFormTs.put("28", "Шунт_Шахты_Введ_ПО28");
                mapFormTs.put("18", "Шунт_Шахты_Введ_ПО6_и_Р12");
                mapFormTs.put("24", "Шунт_Шахты_Введ_ПО8_и_Р90");
                mapFormTs.put("29", "Шунт_Шахты_Введ_ПО29");
                mapFormTs.put("54", "Шунт_Шахты_Введ_ПО54");
                mapFormTs.put("23", "Шунт_Шахты_Введ_ПО23");
                mapFormTs.put("8", "Шунт_Шахты_Введ_ПО8");
                mapFormTs.put("6", "Шунт_Шахты_Введ_ПО6");
                break;
            case "{ВР_БЛ12}":
                mapFormTs.put("42", "Шунт_Волг-Рост+Б1+Б2_Введ_ПО42");
                break;
            case "{ВР_БЛ13}":
                mapFormTs.put("43", "Шунт_Волг-Рост+Б1+Б3_Введ_ПО43");
                break;
            case "{ВР_БЛ23}":
                mapFormTs.put("44", "Шунт_Волг-Рост+Б2+Б3_Введ_ПО44");
                break;
            case "{ВР_БЛ14}":
                mapFormTs.put("45", "Шунт_Волг-Рост+Б1+Б4_Введ_ПО45");
                break;
            case "{ВР_БЛ24}":
                mapFormTs.put("46", "Шунт_Волг-Рост+Б2+Б4_Введ_ПО46");
                break;
            case "{ВР_БЛ34}":
                mapFormTs.put("47", "Шунт_Волг-Рост+Б3+Б4_Введ_ПО47");
                break;
            case "{В_БЛ12}":
                mapFormTs.put("42", "Шунт_Волг+Б1+Б2_Введ_ПО42");
                break;
            case "{В_БЛ13}":
                mapFormTs.put("43", "Шунт_Волг+Б1+Б3_Введ_ПО43");
                break;
            case "{В_БЛ23}":
                mapFormTs.put("44", "Шунт_Волг+Б2+Б3_Введ_ПО44");
                break;
            case "{В_БЛ14}":
                mapFormTs.put("45", "Шунт_Волг+Б1+Б4_Введ_ПО45");
                break;
            case "{В_БЛ24}":
                mapFormTs.put("46", "Шунт_Волг+Б2+Б4_Введ_ПО46");
                break;
            case "{В_БЛ34}":
                mapFormTs.put("47", "Шунт_Волг+Б3+Б4_Введ_ПО47");
                break;
            case "{Ф_БЛ12}":
                mapFormTs.put("42", "Шунт_Фрол+Б1+Б2_Введ_ПО42");
                break;
            case "{Ф_БЛ13}":
                mapFormTs.put("43", "Шунт_Фрол+Б1+Б3_Введ_ПО43");
                break;
            case "{Ф_БЛ23}":
                mapFormTs.put("44", "Шунт_Фрол+Б2+Б3_Введ_ПО44");
                break;
            case "{Ф_БЛ14}":
                mapFormTs.put("45", "Шунт_Фрол+Б1+Б4_Введ_ПО45");
                break;
            case "{Ф_БЛ24}":
                mapFormTs.put("46", "Шунт_Фрол+Б2+Б4_Введ_ПО46");
                break;
            case "{Ф_БЛ34}":
                mapFormTs.put("47", "Шунт_Фрол+Б3+Б4_Введ_ПО47");
                break;
        }
        return mapFormTs;
    }
    public static TreeMap<String, String> getMapPo(){
        TreeMap<String, String> mapPo = new TreeMap<>();
        mapPo.put("1", "ФОЛ_500кВ_РоАЭС–Шахты");
        mapPo.put("2", "ФОЛ_500кВ_РоАЭС–Ростовская");
        mapPo.put("3", "ФОЛ_500кВ_РоАЭС–Георг");
        mapPo.put("4", "ФОЛ_500кВ_Фроловская–Шахты");
        mapPo.put("5", "ФОЛ_500кВ_Победа–Шахты");
        mapPo.put("6", "ФОЛ_500кВ_Балашовская–Фроловская");
        mapPo.put("7", "ФО_АТ-1_500/220кВ_РоАЭС");
        mapPo.put("8", "ФОЛ_500кВ_ВолжскаяГЭС-Фроловская");
        mapPo.put("10", "ФОЛ_330кВ_НчГРЭС–Тихорецк");
        mapPo.put("11", "ФО_Блока_1_Ростовской_АЭС");
        mapPo.put("12", "ФОДЛ_500кВ_Волга-Георг-Трубная");
        mapPo.put("13", "ФОЛ_РоАЭС-Ростов_и_ФОАТ1_РоАЭС");
        mapPo.put("14", "ФОЛ_500кВ_Шахты–Ростовская");
        mapPo.put("15", "ФОАТ-3_500/220кВ_ПС_Шахты");
        mapPo.put("16", "ФОАТ-4_500/220кВ_ПС_Шахты");
        mapPo.put("17", "ФОАТГ-1_500/220кВ_ПС_Ростовская");
        mapPo.put("18", "ФОЛ_500кВ_Балашовская–Фроловская");
        mapPo.put("20", "ФО_Блока_2_Ростовской_АЭС");
        mapPo.put("22", "ФО_Блока_3_Ростовской_АЭС");
        mapPo.put("23", "ФО_Блока_4_Ростовской_АЭС");
        mapPo.put("24", "ФОЛ_500кВ_ВолжскаяГЭС-Фроловская");
        mapPo.put("25", "ФОЛ_500кВ_Шахты–Ростовская");
        mapPo.put("26", "ФОЛ_500кВ_РоАЭС–Шахты");
        mapPo.put("27", "ФО_III_СШ_500кВ_РоАЭС");
        mapPo.put("28", "ФО_IV_СШ_500кВ_РоАЭС");
        mapPo.put("29", "ФО_СШ_500кВ_Шахты");
        mapPo.put("30", "ФОЛ_220_Заливская-ГОК");
        mapPo.put("31", "ФОЛ_220_Волгодонск-ГОК");
        mapPo.put("32", "ФОЛтр-таВолгодонск-ГОК-Заливская");
        mapPo.put("33", "ФОЛ_220_РоАЭС-Котельниково");
        mapPo.put("34", "ФОЛ_220_Заливская-Котельниково");
        mapPo.put("35", "ФОЛтр-таРоАЭС-Котельн-Заливская");
        mapPo.put("36", "ФОЛ_220_Арчеда-Сатаровская");
        mapPo.put("37", "ФОЛ_220_СатаровскаяАндреановская");
        mapPo.put("38", "ФОЛ_220_Андреановская-Вешенская2");
        mapPo.put("39", "ФОЛ_220_Вешенская2-Б10");
        mapPo.put("40", "ФОЛтр-таАрчеда-Б10");
        mapPo.put("41", "ФОЛ_220_Волга-Заливская");
        mapPo.put("42", "ФО_Блок1+Блок2");
        mapPo.put("43", "ФО_Блок1+Блок3");
        mapPo.put("44", "ФО_Блок2+Блок3");
        mapPo.put("45", "ФО_Блок1+Блок4");
        mapPo.put("46", "ФО_Блок2+Блок4");
        mapPo.put("47", "ФО_Блок3+Блок4");
        mapPo.put("48", "ФО_Блок1+ФО_III_СШ_РоАЭС");
        mapPo.put("49", "ФО_Блок2+ФО_IV_СШ_РоАЭС");
        mapPo.put("50", "ФО_Блок3+ФО_III_СШ_РоАЭС");
        mapPo.put("51", "ФО_Блок3+ФО_IV_СШ_РоАЭС");
        mapPo.put("52", "ФО_Блок4+ФО_III_СШ_РоАЭС");
        mapPo.put("53", "ФО_Блок4+ФО_IV_СШ_РоАЭС");
        mapPo.put("54", "ФО_Блок4+ФОЛ_РоАЭС-Шахты");
        mapPo.put("55", "ФОЛ_РоАЭС-Георг+РоАЭС-Буден");
        mapPo.put("56", "ФОЛ_220_Тихорецк-ЕяТяговая");
        mapPo.put("57", "ФОЛ_220_Сальск-Песч");
        mapPo.put("58", "ФОЛ_220_ЕяТяговая-Песч");
        mapPo.put("59", "ФОЛ_330_Южная-Харцызская");
        mapPo.put("60", "ФОЛ_330_Южная-Ростов");
        return mapPo;
    }
    public static TreeMap<String, String> getMapUv(String scheme){
        TreeMap<String, String> mapUv = new TreeMap<>();
        switch (scheme) {
            case "{ВР}":
                mapUv.put("3", "[[{Кор_Ш_В-Р_ПО3}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО3}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН1-КЭ];[{Кор_Ш_В-Р_ПО3}ОН1-РЭ];[{Кор_Ш_В-Р_ПО3}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН2-КЭ];[{Кор_Ш_В-Р_ПО3}ОН2-РЭ];[{Кор_Ш_В-Р_ПО3}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН3-КЭ];[{Кор_Ш_В-Р_ПО3}ОН3-РЭ];[{Кор_Ш_В-Р_ПО3}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН4-КЭ];[{Кор_Ш_В-Р_ПО3}ОН4-РЭ];[{Кор_Ш_В-Р_ПО3}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН5-КЭ];[{Кор_Ш_В-Р_ПО3}ОН5-РЭ];[{Кор_Ш_В-Р_ПО3}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН6-КЭ];[{Кор_Ш_В-Р_ПО3}ОН6-РЭ];[{Кор_Ш_В-Р_ПО3}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО3}ОН9-ВЧ]]");
                mapUv.put("12", "[[{Кор_Ш_В-Р_ПО12}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО12}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН1-КЭ];[{Кор_Ш_В-Р_ПО12}ОН1-РЭ];[{Кор_Ш_В-Р_ПО12}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН2-КЭ];[{Кор_Ш_В-Р_ПО12}ОН2-РЭ];[{Кор_Ш_В-Р_ПО12}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН3-КЭ];[{Кор_Ш_В-Р_ПО12}ОН3-РЭ];[{Кор_Ш_В-Р_ПО12}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН4-КЭ];[{Кор_Ш_В-Р_ПО12}ОН4-РЭ];[{Кор_Ш_В-Р_ПО12}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН5-КЭ];[{Кор_Ш_В-Р_ПО12}ОН5-РЭ];[{Кор_Ш_В-Р_ПО12}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН6-КЭ];[{Кор_Ш_В-Р_ПО12}ОН6-РЭ];[{Кор_Ш_В-Р_ПО12}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО12}ОН9-ВЧ]]");
                mapUv.put("4", "[[{Кор_Ш_В-Р_ПО4}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО4}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН1-КЭ];[{Кор_Ш_В-Р_ПО4}ОН1-РЭ];[{Кор_Ш_В-Р_ПО4}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН2-КЭ];[{Кор_Ш_В-Р_ПО4}ОН2-РЭ];[{Кор_Ш_В-Р_ПО4}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН3-КЭ];[{Кор_Ш_В-Р_ПО4}ОН3-РЭ];[{Кор_Ш_В-Р_ПО4}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН4-КЭ];[{Кор_Ш_В-Р_ПО4}ОН4-РЭ];[{Кор_Ш_В-Р_ПО4}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН5-КЭ];[{Кор_Ш_В-Р_ПО4}ОН5-РЭ];[{Кор_Ш_В-Р_ПО4}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН6-КЭ];[{Кор_Ш_В-Р_ПО4}ОН6-РЭ];[{Кор_Ш_В-Р_ПО4}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО4}ОН9-ВЧ]]");
                mapUv.put("18", "[[{Кор_Ш_В-Р_ПО6}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО6}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН1-КЭ];[{Кор_Ш_В-Р_ПО6}ОН1-РЭ];[{Кор_Ш_В-Р_ПО6}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН2-КЭ];[{Кор_Ш_В-Р_ПО6}ОН2-РЭ];[{Кор_Ш_В-Р_ПО6}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН3-КЭ];[{Кор_Ш_В-Р_ПО6}ОН3-РЭ];[{Кор_Ш_В-Р_ПО6}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН4-КЭ];[{Кор_Ш_В-Р_ПО6}ОН4-РЭ];[{Кор_Ш_В-Р_ПО6}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН5-КЭ];[{Кор_Ш_В-Р_ПО6}ОН5-РЭ];[{Кор_Ш_В-Р_ПО6}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН6-КЭ];[{Кор_Ш_В-Р_ПО6}ОН6-РЭ];[{Кор_Ш_В-Р_ПО6}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН9-ВЧ]]");
                mapUv.put("24", "[[{Кор_Ш_В-Р_ПО8}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО8}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН1-КЭ];[{Кор_Ш_В-Р_ПО8}ОН1-РЭ];[{Кор_Ш_В-Р_ПО8}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН2-КЭ];[{Кор_Ш_В-Р_ПО8}ОН2-РЭ];[{Кор_Ш_В-Р_ПО8}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН3-КЭ];[{Кор_Ш_В-Р_ПО8}ОН3-РЭ];[{Кор_Ш_В-Р_ПО8}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН4-КЭ];[{Кор_Ш_В-Р_ПО8}ОН4-РЭ];[{Кор_Ш_В-Р_ПО8}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН5-КЭ];[{Кор_Ш_В-Р_ПО8}ОН5-РЭ];[{Кор_Ш_В-Р_ПО8}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН6-КЭ];[{Кор_Ш_В-Р_ПО8}ОН6-РЭ];[{Кор_Ш_В-Р_ПО8}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН9-ВЧ]]");
                mapUv.put("36", "[[{Кор_Ш_В-Р_ПО36}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО36}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН1-КЭ];[{Кор_Ш_В-Р_ПО36}ОН1-РЭ];[{Кор_Ш_В-Р_ПО36}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН2-КЭ];[{Кор_Ш_В-Р_ПО36}ОН2-РЭ];[{Кор_Ш_В-Р_ПО36}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН3-КЭ];[{Кор_Ш_В-Р_ПО36}ОН3-РЭ];[{Кор_Ш_В-Р_ПО36}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН4-КЭ];[{Кор_Ш_В-Р_ПО36}ОН4-РЭ];[{Кор_Ш_В-Р_ПО36}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН5-КЭ];[{Кор_Ш_В-Р_ПО36}ОН5-РЭ];[{Кор_Ш_В-Р_ПО36}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН6-КЭ];[{Кор_Ш_В-Р_ПО36}ОН6-РЭ];[{Кор_Ш_В-Р_ПО36}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО36}ОН9-ВЧ]]");
                mapUv.put("37", "[[{Кор_Ш_В-Р_ПО37}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО37}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН1-КЭ];[{Кор_Ш_В-Р_ПО37}ОН1-РЭ];[{Кор_Ш_В-Р_ПО37}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН2-КЭ];[{Кор_Ш_В-Р_ПО37}ОН2-РЭ];[{Кор_Ш_В-Р_ПО37}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН3-КЭ];[{Кор_Ш_В-Р_ПО37}ОН3-РЭ];[{Кор_Ш_В-Р_ПО37}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН4-КЭ];[{Кор_Ш_В-Р_ПО37}ОН4-РЭ];[{Кор_Ш_В-Р_ПО37}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН5-КЭ];[{Кор_Ш_В-Р_ПО37}ОН5-РЭ];[{Кор_Ш_В-Р_ПО37}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН6-КЭ];[{Кор_Ш_В-Р_ПО37}ОН6-РЭ];[{Кор_Ш_В-Р_ПО37}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО37}ОН9-ВЧ]]");
                mapUv.put("38", "[[{Кор_Ш_В-Р_ПО38}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО38}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН1-КЭ];[{Кор_Ш_В-Р_ПО38}ОН1-РЭ];[{Кор_Ш_В-Р_ПО38}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН2-КЭ];[{Кор_Ш_В-Р_ПО38}ОН2-РЭ];[{Кор_Ш_В-Р_ПО38}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН3-КЭ];[{Кор_Ш_В-Р_ПО38}ОН3-РЭ];[{Кор_Ш_В-Р_ПО38}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН4-КЭ];[{Кор_Ш_В-Р_ПО38}ОН4-РЭ];[{Кор_Ш_В-Р_ПО38}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН5-КЭ];[{Кор_Ш_В-Р_ПО38}ОН5-РЭ];[{Кор_Ш_В-Р_ПО38}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН6-КЭ];[{Кор_Ш_В-Р_ПО38}ОН6-РЭ];[{Кор_Ш_В-Р_ПО38}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО38}ОН9-ВЧ]]");
                mapUv.put("39", "[[{Кор_Ш_В-Р_ПО39}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО39}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН1-КЭ];[{Кор_Ш_В-Р_ПО39}ОН1-РЭ];[{Кор_Ш_В-Р_ПО39}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН2-КЭ];[{Кор_Ш_В-Р_ПО39}ОН2-РЭ];[{Кор_Ш_В-Р_ПО39}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН3-КЭ];[{Кор_Ш_В-Р_ПО39}ОН3-РЭ];[{Кор_Ш_В-Р_ПО39}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН4-КЭ];[{Кор_Ш_В-Р_ПО39}ОН4-РЭ];[{Кор_Ш_В-Р_ПО39}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН5-КЭ];[{Кор_Ш_В-Р_ПО39}ОН5-РЭ];[{Кор_Ш_В-Р_ПО39}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН6-КЭ];[{Кор_Ш_В-Р_ПО39}ОН6-РЭ];[{Кор_Ш_В-Р_ПО39}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО39}ОН9-ВЧ]]");
                mapUv.put("40", "[[{Кор_Ш_В-Р_ПО40}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО40}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН1-КЭ];[{Кор_Ш_В-Р_ПО40}ОН1-РЭ];[{Кор_Ш_В-Р_ПО40}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН2-КЭ];[{Кор_Ш_В-Р_ПО40}ОН2-РЭ];[{Кор_Ш_В-Р_ПО40}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН3-КЭ];[{Кор_Ш_В-Р_ПО40}ОН3-РЭ];[{Кор_Ш_В-Р_ПО40}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН4-КЭ];[{Кор_Ш_В-Р_ПО40}ОН4-РЭ];[{Кор_Ш_В-Р_ПО40}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН5-КЭ];[{Кор_Ш_В-Р_ПО40}ОН5-РЭ];[{Кор_Ш_В-Р_ПО40}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН6-КЭ];[{Кор_Ш_В-Р_ПО40}ОН6-РЭ];[{Кор_Ш_В-Р_ПО40}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО40}ОН9-ВЧ]]");
                mapUv.put("27", "[[{Кор_Ш_В-Р_ПО27}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО27}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН1-КЭ];[{Кор_Ш_В-Р_ПО27}ОН1-РЭ];[{Кор_Ш_В-Р_ПО27}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН2-КЭ];[{Кор_Ш_В-Р_ПО27}ОН2-РЭ];[{Кор_Ш_В-Р_ПО27}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН3-КЭ];[{Кор_Ш_В-Р_ПО27}ОН3-РЭ];[{Кор_Ш_В-Р_ПО27}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН4-КЭ];[{Кор_Ш_В-Р_ПО27}ОН4-РЭ];[{Кор_Ш_В-Р_ПО27}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН5-КЭ];[{Кор_Ш_В-Р_ПО27}ОН5-РЭ];[{Кор_Ш_В-Р_ПО27}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН6-КЭ];[{Кор_Ш_В-Р_ПО27}ОН6-РЭ];[{Кор_Ш_В-Р_ПО27}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО27}ОН9-ВЧ]]");
                mapUv.put("28", "[[{Кор_Ш_В-Р_ПО28}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО28}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН1-КЭ];[{Кор_Ш_В-Р_ПО28}ОН1-РЭ];[{Кор_Ш_В-Р_ПО28}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН2-КЭ];[{Кор_Ш_В-Р_ПО28}ОН2-РЭ];[{Кор_Ш_В-Р_ПО28}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН3-КЭ];[{Кор_Ш_В-Р_ПО28}ОН3-РЭ];[{Кор_Ш_В-Р_ПО28}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН4-КЭ];[{Кор_Ш_В-Р_ПО28}ОН4-РЭ];[{Кор_Ш_В-Р_ПО28}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН5-КЭ];[{Кор_Ш_В-Р_ПО28}ОН5-РЭ];[{Кор_Ш_В-Р_ПО28}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН6-КЭ];[{Кор_Ш_В-Р_ПО28}ОН6-РЭ];[{Кор_Ш_В-Р_ПО28}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО28}ОН9-ВЧ]]");
                mapUv.put("29", "[[{Кор_Ш_В-Р_ПО29}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО29}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН1-КЭ];[{Кор_Ш_В-Р_ПО29}ОН1-РЭ];[{Кор_Ш_В-Р_ПО29}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН2-КЭ];[{Кор_Ш_В-Р_ПО29}ОН2-РЭ];[{Кор_Ш_В-Р_ПО29}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН3-КЭ];[{Кор_Ш_В-Р_ПО29}ОН3-РЭ];[{Кор_Ш_В-Р_ПО29}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН4-КЭ];[{Кор_Ш_В-Р_ПО29}ОН4-РЭ];[{Кор_Ш_В-Р_ПО29}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН5-КЭ];[{Кор_Ш_В-Р_ПО29}ОН5-РЭ];[{Кор_Ш_В-Р_ПО29}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН6-КЭ];[{Кор_Ш_В-Р_ПО29}ОН6-РЭ];[{Кор_Ш_В-Р_ПО29}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО29}ОН9-ВЧ]]");
                mapUv.put("41", "[[{Кор_Ш_В-Р_ПО41}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО41}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН1-КЭ];[{Кор_Ш_В-Р_ПО41}ОН1-РЭ];[{Кор_Ш_В-Р_ПО41}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН2-КЭ];[{Кор_Ш_В-Р_ПО41}ОН2-РЭ];[{Кор_Ш_В-Р_ПО41}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН3-КЭ];[{Кор_Ш_В-Р_ПО41}ОН3-РЭ];[{Кор_Ш_В-Р_ПО41}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН4-КЭ];[{Кор_Ш_В-Р_ПО41}ОН4-РЭ];[{Кор_Ш_В-Р_ПО41}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН5-КЭ];[{Кор_Ш_В-Р_ПО41}ОН5-РЭ];[{Кор_Ш_В-Р_ПО41}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН6-КЭ];[{Кор_Ш_В-Р_ПО41}ОН6-РЭ];[{Кор_Ш_В-Р_ПО41}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО41}ОН9-ВЧ]]");
                mapUv.put("30", "[[{Кор_Ш_В-Р_ПО30}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО30}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН1-КЭ];[{Кор_Ш_В-Р_ПО30}ОН1-РЭ];[{Кор_Ш_В-Р_ПО30}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН2-КЭ];[{Кор_Ш_В-Р_ПО30}ОН2-РЭ];[{Кор_Ш_В-Р_ПО30}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН3-КЭ];[{Кор_Ш_В-Р_ПО30}ОН3-РЭ];[{Кор_Ш_В-Р_ПО30}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН4-КЭ];[{Кор_Ш_В-Р_ПО30}ОН4-РЭ];[{Кор_Ш_В-Р_ПО30}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН5-КЭ];[{Кор_Ш_В-Р_ПО30}ОН5-РЭ];[{Кор_Ш_В-Р_ПО30}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН6-КЭ];[{Кор_Ш_В-Р_ПО30}ОН6-РЭ];[{Кор_Ш_В-Р_ПО30}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО30}ОН9-ВЧ]]");
                mapUv.put("31", "[[{Кор_Ш_В-Р_ПО31}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО31}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН1-КЭ];[{Кор_Ш_В-Р_ПО31}ОН1-РЭ];[{Кор_Ш_В-Р_ПО31}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН2-КЭ];[{Кор_Ш_В-Р_ПО31}ОН2-РЭ];[{Кор_Ш_В-Р_ПО31}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН3-КЭ];[{Кор_Ш_В-Р_ПО31}ОН3-РЭ];[{Кор_Ш_В-Р_ПО31}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН4-КЭ];[{Кор_Ш_В-Р_ПО31}ОН4-РЭ];[{Кор_Ш_В-Р_ПО31}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН5-КЭ];[{Кор_Ш_В-Р_ПО31}ОН5-РЭ];[{Кор_Ш_В-Р_ПО31}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН6-КЭ];[{Кор_Ш_В-Р_ПО31}ОН6-РЭ];[{Кор_Ш_В-Р_ПО31}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО31}ОН9-ВЧ]]");
                mapUv.put("32", "[[{Кор_Ш_В-Р_ПО32}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО32}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН1-КЭ];[{Кор_Ш_В-Р_ПО32}ОН1-РЭ];[{Кор_Ш_В-Р_ПО32}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН2-КЭ];[{Кор_Ш_В-Р_ПО32}ОН2-РЭ];[{Кор_Ш_В-Р_ПО32}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН3-КЭ];[{Кор_Ш_В-Р_ПО32}ОН3-РЭ];[{Кор_Ш_В-Р_ПО32}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН4-КЭ];[{Кор_Ш_В-Р_ПО32}ОН4-РЭ];[{Кор_Ш_В-Р_ПО32}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН5-КЭ];[{Кор_Ш_В-Р_ПО32}ОН5-РЭ];[{Кор_Ш_В-Р_ПО32}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН6-КЭ];[{Кор_Ш_В-Р_ПО32}ОН6-РЭ];[{Кор_Ш_В-Р_ПО32}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО32}ОН9-ВЧ]]");
                mapUv.put("33", "[[{Кор_Ш_В-Р_ПО33}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО33}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН1-КЭ];[{Кор_Ш_В-Р_ПО33}ОН1-РЭ];[{Кор_Ш_В-Р_ПО33}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН2-КЭ];[{Кор_Ш_В-Р_ПО33}ОН2-РЭ];[{Кор_Ш_В-Р_ПО33}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН3-КЭ];[{Кор_Ш_В-Р_ПО33}ОН3-РЭ];[{Кор_Ш_В-Р_ПО33}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН4-КЭ];[{Кор_Ш_В-Р_ПО33}ОН4-РЭ];[{Кор_Ш_В-Р_ПО33}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН5-КЭ];[{Кор_Ш_В-Р_ПО33}ОН5-РЭ];[{Кор_Ш_В-Р_ПО33}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН6-КЭ];[{Кор_Ш_В-Р_ПО33}ОН6-РЭ];[{Кор_Ш_В-Р_ПО33}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО33}ОН9-ВЧ]]");
                mapUv.put("34", "[[{Кор_Ш_В-Р_ПО34}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО34}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН1-КЭ];[{Кор_Ш_В-Р_ПО34}ОН1-РЭ];[{Кор_Ш_В-Р_ПО34}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН2-КЭ];[{Кор_Ш_В-Р_ПО34}ОН2-РЭ];[{Кор_Ш_В-Р_ПО34}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН3-КЭ];[{Кор_Ш_В-Р_ПО34}ОН3-РЭ];[{Кор_Ш_В-Р_ПО34}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН4-КЭ];[{Кор_Ш_В-Р_ПО34}ОН4-РЭ];[{Кор_Ш_В-Р_ПО34}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН5-КЭ];[{Кор_Ш_В-Р_ПО34}ОН5-РЭ];[{Кор_Ш_В-Р_ПО34}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН6-КЭ];[{Кор_Ш_В-Р_ПО34}ОН6-РЭ];[{Кор_Ш_В-Р_ПО34}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО34}ОН9-ВЧ]]");
                mapUv.put("35", "[[{Кор_Ш_В-Р_ПО35}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО35}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН1-КЭ];[{Кор_Ш_В-Р_ПО35}ОН1-РЭ];[{Кор_Ш_В-Р_ПО35}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН2-КЭ];[{Кор_Ш_В-Р_ПО35}ОН2-РЭ];[{Кор_Ш_В-Р_ПО35}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН3-КЭ];[{Кор_Ш_В-Р_ПО35}ОН3-РЭ];[{Кор_Ш_В-Р_ПО35}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН4-КЭ];[{Кор_Ш_В-Р_ПО35}ОН4-РЭ];[{Кор_Ш_В-Р_ПО35}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН5-КЭ];[{Кор_Ш_В-Р_ПО35}ОН5-РЭ];[{Кор_Ш_В-Р_ПО35}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН6-КЭ];[{Кор_Ш_В-Р_ПО35}ОН6-РЭ];[{Кор_Ш_В-Р_ПО35}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО35}ОН9-ВЧ]]");
                mapUv.put("6", "[[{Кор_Ш_В-Р_ПО6}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО6}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН1-КЭ];[{Кор_Ш_В-Р_ПО6}ОН1-РЭ];[{Кор_Ш_В-Р_ПО6}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН2-КЭ];[{Кор_Ш_В-Р_ПО6}ОН2-РЭ];[{Кор_Ш_В-Р_ПО6}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН3-КЭ];[{Кор_Ш_В-Р_ПО6}ОН3-РЭ];[{Кор_Ш_В-Р_ПО6}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН4-КЭ];[{Кор_Ш_В-Р_ПО6}ОН4-РЭ];[{Кор_Ш_В-Р_ПО6}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН5-КЭ];[{Кор_Ш_В-Р_ПО6}ОН5-РЭ];[{Кор_Ш_В-Р_ПО6}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН6-КЭ];[{Кор_Ш_В-Р_ПО6}ОН6-РЭ];[{Кор_Ш_В-Р_ПО6}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО6}ОН9-ВЧ]]");
                mapUv.put("8", "[[{Кор_Ш_В-Р_ПО8}ОН1+2-Крым];[{Кор_Ш_В-Р_ПО8}ОН1-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН1-КЭ];[{Кор_Ш_В-Р_ПО8}ОН1-РЭ];[{Кор_Ш_В-Р_ПО8}ОН2-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН2-КЭ];[{Кор_Ш_В-Р_ПО8}ОН2-РЭ];[{Кор_Ш_В-Р_ПО8}ОН3-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН3-КЭ];[{Кор_Ш_В-Р_ПО8}ОН3-РЭ];[{Кор_Ш_В-Р_ПО8}ОН4-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН4-КЭ];[{Кор_Ш_В-Р_ПО8}ОН4-РЭ];[{Кор_Ш_В-Р_ПО8}ОН5-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН5-КЭ];[{Кор_Ш_В-Р_ПО8}ОН5-РЭ];[{Кор_Ш_В-Р_ПО8}ОН6-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН6-КЭ];[{Кор_Ш_В-Р_ПО8}ОН6-РЭ];[{Кор_Ш_В-Р_ПО8}ОН7-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН8-ВЧ];[{Кор_Ш_В-Р_ПО8}ОН9-ВЧ]]");
                break;
            case "{РВ}":
                mapUv.put("3", "[[{Кор_Ш_Р-В_ПО3}ОГ150];[{Кор_Ш_Р-В_ПО3}ОГ300];[{Кор_Ш_Р-В_ПО3}ОГ450];[{Кор_Ш_Р-В_ПО3}ОГ600];[{Кор_Ш_Р-В_ПО3}ОГ750];[{Кор_Ш_Р-В_ПО3}ОГ900]]");
                mapUv.put("12", "[[{Кор_Ш_Р-В_ПО12}ОГ150];[{Кор_Ш_Р-В_ПО12}ОГ300];[{Кор_Ш_Р-В_ПО12}ОГ450];[{Кор_Ш_Р-В_ПО12}ОГ600];[{Кор_Ш_Р-В_ПО12}ОГ750];[{Кор_Ш_Р-В_ПО12}ОГ900]]");
                mapUv.put("4", "[[{Кор_Ш_Р-В_ПО4}ОГ150];[{Кор_Ш_Р-В_ПО4}ОГ300];[{Кор_Ш_Р-В_ПО4}ОГ450];[{Кор_Ш_Р-В_ПО4}ОГ600];[{Кор_Ш_Р-В_ПО4}ОГ750];[{Кор_Ш_Р-В_ПО4}ОГ900]]");
                mapUv.put("18", "[[{Кор_Ш_Р-В_ПО6}ОГ150];[{Кор_Ш_Р-В_ПО6}ОГ300];[{Кор_Ш_Р-В_ПО6}ОГ450];[{Кор_Ш_Р-В_ПО6}ОГ600];[{Кор_Ш_Р-В_ПО6}ОГ750];[{Кор_Ш_Р-В_ПО6}ОГ900]]");
                mapUv.put("24", "[[{Кор_Ш_Р-В_ПО8}ОГ150];[{Кор_Ш_Р-В_ПО8}ОГ300];[{Кор_Ш_Р-В_ПО8}ОГ450];[{Кор_Ш_Р-В_ПО8}ОГ600];[{Кор_Ш_Р-В_ПО8}ОГ750];[{Кор_Ш_Р-В_ПО8}ОГ900]]");
                mapUv.put("26", "[[{Кор_Ш_Р-В_ПО1}ОГ150];[{Кор_Ш_Р-В_ПО1}ОГ300];[{Кор_Ш_Р-В_ПО1}ОГ450];[{Кор_Ш_Р-В_ПО1}ОГ600];[{Кор_Ш_Р-В_ПО1}ОГ750];[{Кор_Ш_Р-В_ПО1}ОГ900]]");
                mapUv.put("25", "[[{Кор_Ш_Р-В_ПО14}ОГ150];[{Кор_Ш_Р-В_ПО14}ОГ300];[{Кор_Ш_Р-В_ПО14}ОГ450];[{Кор_Ш_Р-В_ПО14}ОГ600];[{Кор_Ш_Р-В_ПО14}ОГ750];[{Кор_Ш_Р-В_ПО14}ОГ900]]");
                mapUv.put("36", "[[{Кор_Ш_Р-В_ПО36}ОГ150];[{Кор_Ш_Р-В_ПО36}ОГ300];[{Кор_Ш_Р-В_ПО36}ОГ450];[{Кор_Ш_Р-В_ПО36}ОГ600];[{Кор_Ш_Р-В_ПО36}ОГ750];[{Кор_Ш_Р-В_ПО36}ОГ900]]");
                mapUv.put("37", "[[{Кор_Ш_Р-В_ПО37}ОГ150];[{Кор_Ш_Р-В_ПО37}ОГ300];[{Кор_Ш_Р-В_ПО37}ОГ450];[{Кор_Ш_Р-В_ПО37}ОГ600];[{Кор_Ш_Р-В_ПО37}ОГ750];[{Кор_Ш_Р-В_ПО37}ОГ900]]");
                mapUv.put("38", "[[{Кор_Ш_Р-В_ПО38}ОГ150];[{Кор_Ш_Р-В_ПО38}ОГ300];[{Кор_Ш_Р-В_ПО38}ОГ450];[{Кор_Ш_Р-В_ПО38}ОГ600];[{Кор_Ш_Р-В_ПО38}ОГ750];[{Кор_Ш_Р-В_ПО38}ОГ900]]");
                mapUv.put("39", "[[{Кор_Ш_Р-В_ПО39}ОГ150];[{Кор_Ш_Р-В_ПО39}ОГ300];[{Кор_Ш_Р-В_ПО39}ОГ450];[{Кор_Ш_Р-В_ПО39}ОГ600];[{Кор_Ш_Р-В_ПО39}ОГ750];[{Кор_Ш_Р-В_ПО39}ОГ900]]");
                mapUv.put("40", "[[{Кор_Ш_Р-В_ПО40}ОГ150];[{Кор_Ш_Р-В_ПО40}ОГ300];[{Кор_Ш_Р-В_ПО40}ОГ450];[{Кор_Ш_Р-В_ПО40}ОГ600];[{Кор_Ш_Р-В_ПО40}ОГ750];[{Кор_Ш_Р-В_ПО40}ОГ900]]");
                mapUv.put("27", "[[{Кор_Ш_Р-В_ПО27}ОГ150];[{Кор_Ш_Р-В_ПО27}ОГ300];[{Кор_Ш_Р-В_ПО27}ОГ450];[{Кор_Ш_Р-В_ПО27}ОГ600];[{Кор_Ш_Р-В_ПО27}ОГ750];[{Кор_Ш_Р-В_ПО27}ОГ900]]");
                mapUv.put("28", "[[{Кор_Ш_Р-В_ПО28}ОГ150];[{Кор_Ш_Р-В_ПО28}ОГ300];[{Кор_Ш_Р-В_ПО28}ОГ450];[{Кор_Ш_Р-В_ПО28}ОГ600];[{Кор_Ш_Р-В_ПО28}ОГ750];[{Кор_Ш_Р-В_ПО28}ОГ900]]");
                mapUv.put("29", "[[{Кор_Ш_Р-В_ПО29}ОГ150];[{Кор_Ш_Р-В_ПО29}ОГ300];[{Кор_Ш_Р-В_ПО29}ОГ450];[{Кор_Ш_Р-В_ПО29}ОГ600];[{Кор_Ш_Р-В_ПО29}ОГ750];[{Кор_Ш_Р-В_ПО29}ОГ900]]");
                mapUv.put("41", "[[{Кор_Ш_Р-В_ПО41}ОГ150];[{Кор_Ш_Р-В_ПО41}ОГ300];[{Кор_Ш_Р-В_ПО41}ОГ450];[{Кор_Ш_Р-В_ПО41}ОГ600];[{Кор_Ш_Р-В_ПО41}ОГ750];[{Кор_Ш_Р-В_ПО41}ОГ900]]");
                mapUv.put("30", "[[{Кор_Ш_Р-В_ПО30}ОГ150];[{Кор_Ш_Р-В_ПО30}ОГ300];[{Кор_Ш_Р-В_ПО30}ОГ450];[{Кор_Ш_Р-В_ПО30}ОГ600];[{Кор_Ш_Р-В_ПО30}ОГ750];[{Кор_Ш_Р-В_ПО30}ОГ900]]");
                mapUv.put("31", "[[{Кор_Ш_Р-В_ПО31}ОГ150];[{Кор_Ш_Р-В_ПО31}ОГ300];[{Кор_Ш_Р-В_ПО31}ОГ450];[{Кор_Ш_Р-В_ПО31}ОГ600];[{Кор_Ш_Р-В_ПО31}ОГ750];[{Кор_Ш_Р-В_ПО31}ОГ900]]");
                mapUv.put("32", "[[{Кор_Ш_Р-В_ПО32}ОГ150];[{Кор_Ш_Р-В_ПО32}ОГ300];[{Кор_Ш_Р-В_ПО32}ОГ450];[{Кор_Ш_Р-В_ПО32}ОГ600];[{Кор_Ш_Р-В_ПО32}ОГ750];[{Кор_Ш_Р-В_ПО32}ОГ900]]");
                mapUv.put("33", "[[{Кор_Ш_Р-В_ПО33}ОГ150];[{Кор_Ш_Р-В_ПО33}ОГ300];[{Кор_Ш_Р-В_ПО33}ОГ450];[{Кор_Ш_Р-В_ПО33}ОГ600];[{Кор_Ш_Р-В_ПО33}ОГ750];[{Кор_Ш_Р-В_ПО33}ОГ900]]");
                mapUv.put("34", "[[{Кор_Ш_Р-В_ПО34}ОГ150];[{Кор_Ш_Р-В_ПО34}ОГ300];[{Кор_Ш_Р-В_ПО34}ОГ450];[{Кор_Ш_Р-В_ПО34}ОГ600];[{Кор_Ш_Р-В_ПО34}ОГ750];[{Кор_Ш_Р-В_ПО34}ОГ900]]");
                mapUv.put("35", "[[{Кор_Ш_Р-В_ПО35}ОГ150];[{Кор_Ш_Р-В_ПО35}ОГ300];[{Кор_Ш_Р-В_ПО35}ОГ450];[{Кор_Ш_Р-В_ПО35}ОГ600];[{Кор_Ш_Р-В_ПО35}ОГ750];[{Кор_Ш_Р-В_ПО35}ОГ900]]");
                mapUv.put("6", "[[{Кор_Ш_Р-В_ПО6}ОГ150];[{Кор_Ш_Р-В_ПО6}ОГ300];[{Кор_Ш_Р-В_ПО6}ОГ450];[{Кор_Ш_Р-В_ПО6}ОГ600];[{Кор_Ш_Р-В_ПО6}ОГ750];[{Кор_Ш_Р-В_ПО6}ОГ900]]");
                mapUv.put("8", "[[{Кор_Ш_Р-В_ПО8}ОГ150];[{Кор_Ш_Р-В_ПО8}ОГ300];[{Кор_Ш_Р-В_ПО8}ОГ450];[{Кор_Ш_Р-В_ПО8}ОГ600];[{Кор_Ш_Р-В_ПО8}ОГ750];[{Кор_Ш_Р-В_ПО8}ОГ900]]");
                break;
            case "{ВР_БЛ1}":
                mapUv.put("11", "[[{Кор_Ш_В-Р+Б1_ПО11}ОН1+2-Крым];[{Кор_Ш_В-Р+Б1_ПО11}ОН1-РЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН1-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН1-КЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН2-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН2-КЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН2-РЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН3-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН3-КЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН3-РЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН4-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН4-КЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН4-РЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН5-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН5-КЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН5-РЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН6-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН6-КЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН6-РЭ];[{Кор_Ш_В-Р+Б1_ПО11}ОН7-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН8-ВЧ];[{Кор_Ш_В-Р+Б1_ПО11}ОН9-ВЧ]]");
                mapUv.put("48", "[[{Кор_Ш_В-Р+Б1_ПО48}ОН1+2-Крым];[{Кор_Ш_В-Р+Б1_ПО48}ОН1-РЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН1-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН1-КЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН2-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН2-КЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН2-РЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН3-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН3-КЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН3-РЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН4-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН4-КЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН4-РЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН5-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН5-КЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН5-РЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН6-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН6-КЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН6-РЭ];[{Кор_Ш_В-Р+Б1_ПО48}ОН7-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН8-ВЧ];[{Кор_Ш_В-Р+Б1_ПО48}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ2}":
                mapUv.put("20", "[[{Кор_Ш_В-Р+Б2_ПО20}ОН1+2-Крым];[{Кор_Ш_В-Р+Б2_ПО20}ОН1-РЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН1-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН1-КЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН2-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН2-КЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН2-РЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН3-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН3-КЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН3-РЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН4-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН4-КЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН4-РЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН5-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН5-КЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН5-РЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН6-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН6-КЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН6-РЭ];[{Кор_Ш_В-Р+Б2_ПО20}ОН7-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН8-ВЧ];[{Кор_Ш_В-Р+Б2_ПО20}ОН9-ВЧ]]");
                mapUv.put("49", "[[{Кор_Ш_В-Р+Б2_ПО49}ОН1+2-Крым];[{Кор_Ш_В-Р+Б2_ПО49}ОН1-РЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН1-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН1-КЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН2-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН2-КЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН2-РЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН3-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН3-КЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН3-РЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН4-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН4-КЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН4-РЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН5-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН5-КЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН5-РЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН6-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН6-КЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН6-РЭ];[{Кор_Ш_В-Р+Б2_ПО49}ОН7-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН8-ВЧ];[{Кор_Ш_В-Р+Б2_ПО49}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ3}":
                mapUv.put("22", "[[{Кор_Ш_В-Р+Б3_ПО22}ОН1+2-Крым];[{Кор_Ш_В-Р+Б3_ПО22}ОН1-РЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН1-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН1-КЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН2-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН2-КЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН2-РЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН3-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН3-КЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН3-РЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН4-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН4-КЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН4-РЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН5-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН5-КЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН5-РЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН6-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН6-КЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН6-РЭ];[{Кор_Ш_В-Р+Б3_ПО22}ОН7-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН8-ВЧ];[{Кор_Ш_В-Р+Б3_ПО22}ОН9-ВЧ]]");
                mapUv.put("50", "[[{Кор_Ш_В-Р+Б3_ПО50}ОН1+2-Крым];[{Кор_Ш_В-Р+Б3_ПО50}ОН1-РЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН1-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН1-КЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН2-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН2-КЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН2-РЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН3-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН3-КЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН3-РЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН4-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН4-КЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН4-РЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН5-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН5-КЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН5-РЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН6-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН6-КЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН6-РЭ];[{Кор_Ш_В-Р+Б3_ПО50}ОН7-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН8-ВЧ];[{Кор_Ш_В-Р+Б3_ПО50}ОН9-ВЧ]]");
                mapUv.put("51", "[[{Кор_Ш_В-Р+Б3_ПО51}ОН1+2-Крым];[{Кор_Ш_В-Р+Б3_ПО51}ОН1-РЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН1-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН1-КЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН2-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН2-КЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН2-РЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН3-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН3-КЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН3-РЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН4-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН4-КЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН4-РЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН5-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН5-КЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН5-РЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН6-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН6-КЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН6-РЭ];[{Кор_Ш_В-Р+Б3_ПО51}ОН7-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН8-ВЧ];[{Кор_Ш_В-Р+Б3_ПО51}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ4}":
                mapUv.put("23", "[[{Кор_Ш_В-Р+Б4_ПО23}ОН1+2-Крым];[{Кор_Ш_В-Р+Б4_ПО23}ОН1-РЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН1-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН1-КЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН2-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН2-КЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН2-РЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН3-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН3-КЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН3-РЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН4-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН4-КЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН4-РЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН5-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН5-КЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН5-РЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН6-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН6-КЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН6-РЭ];[{Кор_Ш_В-Р+Б4_ПО23}ОН7-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН8-ВЧ];[{Кор_Ш_В-Р+Б4_ПО23}ОН9-ВЧ]]");
                mapUv.put("52", "[[{Кор_Ш_В-Р+Б4_ПО52}ОН1+2-Крым];[{Кор_Ш_В-Р+Б4_ПО52}ОН1-РЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН1-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН1-КЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН2-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН2-КЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН2-РЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН3-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН3-КЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН3-РЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН4-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН4-КЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН4-РЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН5-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН5-КЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН5-РЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН6-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН6-КЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН6-РЭ];[{Кор_Ш_В-Р+Б4_ПО52}ОН7-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН8-ВЧ];[{Кор_Ш_В-Р+Б4_ПО52}ОН9-ВЧ]]");
                mapUv.put("53", "[[{Кор_Ш_В-Р+Б4_ПО53}ОН1+2-Крым];[{Кор_Ш_В-Р+Б4_ПО53}ОН1-РЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН1-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН1-КЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН2-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН2-КЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН2-РЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН3-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН3-КЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН3-РЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН4-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН4-КЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН4-РЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН5-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН5-КЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН5-РЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН6-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН6-КЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН6-РЭ];[{Кор_Ш_В-Р+Б4_ПО53}ОН7-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН8-ВЧ];[{Кор_Ш_В-Р+Б4_ПО53}ОН9-ВЧ]]");
                break;
            case "{РВ_ПШ}":
                mapUv.put("5", "[[{Кор_Ш_Р-В+ПШ_ПО5}ОГ150];[{Кор_Ш_Р-В+ПШ_ПО5}ОГ300];[{Кор_Ш_Р-В+ПШ_ПО5}ОГ450];[{Кор_Ш_Р-В+ПШ_ПО5}ОГ600];[{Кор_Ш_Р-В+ПШ_ПО5}ОГ750];[{Кор_Ш_Р-В+ПШ_ПО5}ОГ900]]");
                mapUv.put("29", "[[{Кор_Ш_Р-В+ПШ_ПО29}ОГ150];[{Кор_Ш_Р-В+ПШ_ПО29}ОГ300];[{Кор_Ш_Р-В+ПШ_ПО29}ОГ450];[{Кор_Ш_Р-В+ПШ_ПО29}ОГ600];[{Кор_Ш_Р-В+ПШ_ПО29}ОГ750];[{Кор_Ш_Р-В+ПШ_ПО29}ОГ900]]");
                break;
            case "{В_БЛ1}":
                mapUv.put("11", "[[{Кор_Ш_Вол+Б1_ПО11}ОН1+2-Крым];[{Кор_Ш_Вол+Б1_ПО11}ОН1-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН1-КЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН1-РЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН2-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН2-КЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН2-РЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН3-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН3-КЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН3-РЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН4-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН4-КЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН4-РЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН5-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН5-КЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН5-РЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН6-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН6-КЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН6-РЭ];[{Кор_Ш_Вол+Б1_ПО11}ОН7-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН8-ВЧ];[{Кор_Ш_Вол+Б1_ПО11}ОН9-ВЧ]]");
                break;
            case "{В_БЛ2}":
                mapUv.put("20", "[[{Кор_Ш_Вол+Б2_ПО20}ОН1+2-Крым];[{Кор_Ш_Вол+Б2_ПО20}ОН1-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН1-КЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН1-РЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН2-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН2-КЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН2-РЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН3-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН3-КЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН3-РЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН4-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН4-КЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН4-РЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН5-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН5-КЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН5-РЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН6-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН6-КЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН6-РЭ];[{Кор_Ш_Вол+Б2_ПО20}ОН7-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН8-ВЧ];[{Кор_Ш_Вол+Б2_ПО20}ОН9-ВЧ]]");
                break;
            case "{В_БЛ3}":
                mapUv.put("22", "[[{Кор_Ш_Вол+Б3_ПО22}ОН1+2-Крым];[{Кор_Ш_Вол+Б3_ПО22}ОН1-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН1-КЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН1-РЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН2-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН2-КЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН2-РЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН3-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН3-КЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН3-РЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН4-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН4-КЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН4-РЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН5-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН5-КЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН5-РЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН6-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН6-КЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН6-РЭ];[{Кор_Ш_Вол+Б3_ПО22}ОН7-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН8-ВЧ];[{Кор_Ш_Вол+Б3_ПО22}ОН9-ВЧ]]");
                break;
            case "{В_БЛ4}":
                mapUv.put("23", "[[{Кор_Ш_Вол+Б4_ПО23}ОН1+2-Крым];[{Кор_Ш_Вол+Б4_ПО23}ОН1-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН1-КЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН1-РЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН2-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН2-КЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН2-РЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН3-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН3-КЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН3-РЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН4-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН4-КЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН4-РЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН5-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН5-КЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН5-РЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН6-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН6-КЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН6-РЭ];[{Кор_Ш_Вол+Б4_ПО23}ОН7-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН8-ВЧ];[{Кор_Ш_Вол+Б4_ПО23}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ1}":
                mapUv.put("11", "[[{Кор_Ш_Фрол-е+Б1_ПО11}ОН1+2-Крым];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН1-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН1-КЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН1-РЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН2-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН2-КЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН2-РЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН3-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН3-КЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН3-РЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН4-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН4-КЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН4-РЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН5-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН5-КЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН5-РЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН6-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН6-КЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН6-РЭ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН7-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН8-ВЧ];[{Кор_Ш_Фрол-е+Б1_ПО11}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ2}":
                mapUv.put("20", "[[{Кор_Ш_Фрол-е+Б2_ПО20}ОН1+2-Крым];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН1-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН1-КЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН1-РЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН2-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН2-КЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН2-РЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН3-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН3-КЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН3-РЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН4-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН4-КЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН4-РЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН5-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН5-КЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН5-РЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН6-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН6-КЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН6-РЭ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН7-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН8-ВЧ];[{Кор_Ш_Фрол-е+Б2_ПО20}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ3}":
                mapUv.put("22", "[[{Кор_Ш_Фрол-е+Б3_ПО22}ОН1+2-Крым];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН1-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН1-КЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН1-РЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН2-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН2-КЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН2-РЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН3-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН3-КЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН3-РЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН4-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН4-КЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН4-РЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН5-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН5-КЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН5-РЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН6-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН6-КЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН6-РЭ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН7-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН8-ВЧ];[{Кор_Ш_Фрол-е+Б3_ПО22}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ4}":
                mapUv.put("23", "[[{Кор_Ш_Фрол-е+Б4_ПО23}ОН1+2-Крым];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН1-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН1-КЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН1-РЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН2-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН2-КЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН2-РЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН3-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН3-КЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН3-РЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН4-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН4-КЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН4-РЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН5-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН5-КЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН5-РЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН6-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН6-КЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН6-РЭ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН7-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН8-ВЧ];[{Кор_Ш_Фрол-е+Б4_ПО23}ОН9-ВЧ]]");
                break;
            case "{В_ПШ}":
                mapUv.put("5", "[[{Кор_Ш_ВолгИзЭСЮга+ПШ_ПО5}ОГ150];[{Кор_Ш_ВолгИзЭСЮга+ПШ_ПО5}ОГ300];[{Кор_Ш_ВолгИзЭСЮга+ПШ_ПО5}ОГ450];[{Кор_Ш_ВолгИзЭСЮга+ПШ_ПО5}ОГ600];[{Кор_Ш_ВолгИзЭСЮга+ПШ_ПО5}ОГ750];[{Кор_Ш_ВолгИзЭСЮга+ПШ_ПО5}ОГ900]]");
                break;
            case "{Ф_ПШ}":
                mapUv.put("5", "[[{Кор_Ш_ФролИзЭСЮга+ПШ_ПО5}ОГ150];[{Кор_Ш_ФролИзЭСЮга+ПШ_ПО5}ОГ300];[{Кор_Ш_ФролИзЭСЮга+ПШ_ПО5}ОГ450];[{Кор_Ш_ФролИзЭСЮга+ПШ_ПО5}ОГ600];[{Кор_Ш_ФролИзЭСЮга+ПШ_ПО5}ОГ750];[{Кор_Ш_ФролИзЭСЮга+ПШ_ПО5}ОГ900]]");
                break;
            case "{С}":
                mapUv.put("3", "[[{Кор_Ш_Сев_ПО3}ОГ150];[{Кор_Ш_Сев_ПО3}ОГ300];[{Кор_Ш_Сев_ПО3}ОГ450];[{Кор_Ш_Сев_ПО3}ОГ600];[{Кор_Ш_Сев_ПО3}ОГ750];[{Кор_Ш_Сев_ПО3}ОГ900]]");
                mapUv.put("2", "[[{Кор_Ш_Сев_ПО2}ОГ150];[{Кор_Ш_Сев_ПО2}ОГ300];[{Кор_Ш_Сев_ПО2}ОГ450];[{Кор_Ш_Сев_ПО2}ОГ600];[{Кор_Ш_Сев_ПО2}ОГ750];[{Кор_Ш_Сев_ПО2}ОГ900]]");
                mapUv.put("1", "[[{Кор_Ш_Сев_ПО1}ОГ150];[{Кор_Ш_Сев_ПО1}ОГ300];[{Кор_Ш_Сев_ПО1}ОГ450];[{Кор_Ш_Сев_ПО1}ОГ600];[{Кор_Ш_Сев_ПО1}ОГ750];[{Кор_Ш_Сев_ПО1}ОГ900]]");
                mapUv.put("12", "[[{Кор_Ш_Сев_ПО12}ОГ150];[{Кор_Ш_Сев_ПО12}ОГ300];[{Кор_Ш_Сев_ПО12}ОГ450];[{Кор_Ш_Сев_ПО12}ОГ600];[{Кор_Ш_Сев_ПО12}ОГ750];[{Кор_Ш_Сев_ПО12}ОГ900]]");
                mapUv.put("10", "[[{Кор_Ш_Сев_ПО10}ОГ150];[{Кор_Ш_Сев_ПО10}ОГ300];[{Кор_Ш_Сев_ПО10}ОГ450];[{Кор_Ш_Сев_ПО10}ОГ600];[{Кор_Ш_Сев_ПО10}ОГ750];[{Кор_Ш_Сев_ПО10}ОГ900]]");
                mapUv.put("27", "[[{Кор_Ш_Сев_ПО27}ОГ150];[{Кор_Ш_Сев_ПО27}ОГ300];[{Кор_Ш_Сев_ПО27}ОГ450];[{Кор_Ш_Сев_ПО27}ОГ600];[{Кор_Ш_Сев_ПО27}ОГ750];[{Кор_Ш_Сев_ПО27}ОГ900]]");
                mapUv.put("28", "[[{Кор_Ш_Сев_ПО28}ОГ150];[{Кор_Ш_Сев_ПО28}ОГ300];[{Кор_Ш_Сев_ПО28}ОГ450];[{Кор_Ш_Сев_ПО28}ОГ600];[{Кор_Ш_Сев_ПО28}ОГ750];[{Кор_Ш_Сев_ПО28}ОГ900]]");
                mapUv.put("7", "[[{Кор_Ш_Сев_ПО7}ОГ150];[{Кор_Ш_Сев_ПО7}ОГ300];[{Кор_Ш_Сев_ПО7}ОГ450];[{Кор_Ш_Сев_ПО7}ОГ600];[{Кор_Ш_Сев_ПО7}ОГ750];[{Кор_Ш_Сев_ПО7}ОГ900]]");
                mapUv.put("13", "[[{Кор_Ш_Сев_ПО13}ОГ150];[{Кор_Ш_Сев_ПО13}ОГ300];[{Кор_Ш_Сев_ПО13}ОГ450];[{Кор_Ш_Сев_ПО13}ОГ600];[{Кор_Ш_Сев_ПО13}ОГ750];[{Кор_Ш_Сев_ПО13}ОГ900]]");
                mapUv.put("56", "[[{Кор_Ш_Сев_ПО56}ОГ150];[{Кор_Ш_Сев_ПО56}ОГ300];[{Кор_Ш_Сев_ПО56}ОГ450];[{Кор_Ш_Сев_ПО56}ОГ600];[{Кор_Ш_Сев_ПО56}ОГ750];[{Кор_Ш_Сев_ПО56}ОГ900]]");
                mapUv.put("57", "[[{Кор_Ш_Сев_ПО57}ОГ150];[{Кор_Ш_Сев_ПО57}ОГ300];[{Кор_Ш_Сев_ПО57}ОГ450];[{Кор_Ш_Сев_ПО57}ОГ600];[{Кор_Ш_Сев_ПО57}ОГ750];[{Кор_Ш_Сев_ПО57}ОГ900]]");
                mapUv.put("58", "[[{Кор_Ш_Сев_ПО58}ОГ150];[{Кор_Ш_Сев_ПО58}ОГ300];[{Кор_Ш_Сев_ПО58}ОГ450];[{Кор_Ш_Сев_ПО58}ОГ600];[{Кор_Ш_Сев_ПО58}ОГ750];[{Кор_Ш_Сев_ПО58}ОГ900]]");
                break;
            case "{Ш}":
                mapUv.put("13", "[[{Кор_Ш_Шах_ПО13}ОН1-КЭ];[{Кор_Ш_Шах_ПО13}ОН1-РЭ];[{Кор_Ш_Шах_ПО13}ОН2-КЭ];[{Кор_Ш_Шах_ПО13}ОН2-РЭ];[{Кор_Ш_Шах_ПО13}ОН3-КЭ];[{Кор_Ш_Шах_ПО13}ОН3-РЭ];[{Кор_Ш_Шах_ПО13}ОН4-КЭ];[{Кор_Ш_Шах_ПО13}ОН4-РЭ];[{Кор_Ш_Шах_ПО13}ОН5-КЭ];[{Кор_Ш_Шах_ПО13}ОН5-РЭ];[{Кор_Ш_Шах_ПО13}ОН6-КЭ];[{Кор_Ш_Шах_ПО13}ОН6-РЭ]]");
                mapUv.put("2", "[[{Кор_Ш_Шах_ПО2}ОН1-КЭ];[{Кор_Ш_Шах_ПО2}ОН1-РЭ];[{Кор_Ш_Шах_ПО2}ОН2-КЭ];[{Кор_Ш_Шах_ПО2}ОН2-РЭ];[{Кор_Ш_Шах_ПО2}ОН3-КЭ];[{Кор_Ш_Шах_ПО2}ОН3-РЭ];[{Кор_Ш_Шах_ПО2}ОН4-КЭ];[{Кор_Ш_Шах_ПО2}ОН4-РЭ];[{Кор_Ш_Шах_ПО2}ОН5-КЭ];[{Кор_Ш_Шах_ПО2}ОН5-РЭ];[{Кор_Ш_Шах_ПО2}ОН6-КЭ];[{Кор_Ш_Шах_ПО2}ОН6-РЭ]]");
                mapUv.put("1", "[[{Кор_Ш_Шах_ПО1}ОН1-КЭ];[{Кор_Ш_Шах_ПО1}ОН1-РЭ];[{Кор_Ш_Шах_ПО1}ОН2-КЭ];[{Кор_Ш_Шах_ПО1}ОН2-РЭ];[{Кор_Ш_Шах_ПО1}ОН3-КЭ];[{Кор_Ш_Шах_ПО1}ОН3-РЭ];[{Кор_Ш_Шах_ПО1}ОН4-КЭ];[{Кор_Ш_Шах_ПО1}ОН4-РЭ];[{Кор_Ш_Шах_ПО1}ОН5-КЭ];[{Кор_Ш_Шах_ПО1}ОН5-РЭ];[{Кор_Ш_Шах_ПО1}ОН6-КЭ];[{Кор_Ш_Шах_ПО1}ОН6-РЭ]]");
                mapUv.put("4", "[[{Кор_Ш_Шах_ПО4}ОН1-КЭ];[{Кор_Ш_Шах_ПО4}ОН1-РЭ];[{Кор_Ш_Шах_ПО4}ОН2-КЭ];[{Кор_Ш_Шах_ПО4}ОН2-РЭ];[{Кор_Ш_Шах_ПО4}ОН3-КЭ];[{Кор_Ш_Шах_ПО4}ОН3-РЭ];[{Кор_Ш_Шах_ПО4}ОН4-КЭ];[{Кор_Ш_Шах_ПО4}ОН4-РЭ];[{Кор_Ш_Шах_ПО4}ОН5-КЭ];[{Кор_Ш_Шах_ПО4}ОН5-РЭ];[{Кор_Ш_Шах_ПО4}ОН6-КЭ];[{Кор_Ш_Шах_ПО4}ОН6-РЭ]]");
                mapUv.put("7", "[[{Кор_Ш_Шах_ПО7}ОН1-КЭ];[{Кор_Ш_Шах_ПО7}ОН1-РЭ];[{Кор_Ш_Шах_ПО7}ОН2-КЭ];[{Кор_Ш_Шах_ПО7}ОН2-РЭ];[{Кор_Ш_Шах_ПО7}ОН3-КЭ];[{Кор_Ш_Шах_ПО7}ОН3-РЭ];[{Кор_Ш_Шах_ПО7}ОН4-КЭ];[{Кор_Ш_Шах_ПО7}ОН4-РЭ];[{Кор_Ш_Шах_ПО7}ОН5-КЭ];[{Кор_Ш_Шах_ПО7}ОН5-РЭ];[{Кор_Ш_Шах_ПО7}ОН6-КЭ];[{Кор_Ш_Шах_ПО7}ОН6-РЭ]]");
                mapUv.put("14", "[[{Кор_Ш_Шах_ПО14}ОН1-КЭ];[{Кор_Ш_Шах_ПО14}ОН1-РЭ];[{Кор_Ш_Шах_ПО14}ОН2-КЭ];[{Кор_Ш_Шах_ПО14}ОН2-РЭ];[{Кор_Ш_Шах_ПО14}ОН3-КЭ];[{Кор_Ш_Шах_ПО14}ОН3-РЭ];[{Кор_Ш_Шах_ПО14}ОН4-КЭ];[{Кор_Ш_Шах_ПО14}ОН4-РЭ];[{Кор_Ш_Шах_ПО14}ОН5-КЭ];[{Кор_Ш_Шах_ПО14}ОН5-РЭ];[{Кор_Ш_Шах_ПО14}ОН6-КЭ];[{Кор_Ш_Шах_ПО14}ОН6-РЭ]]");
                mapUv.put("17", "[[{Кор_Ш_Шах_ПО17}ОН1-КЭ];[{Кор_Ш_Шах_ПО17}ОН1-РЭ];[{Кор_Ш_Шах_ПО17}ОН2-КЭ];[{Кор_Ш_Шах_ПО17}ОН2-РЭ];[{Кор_Ш_Шах_ПО17}ОН3-КЭ];[{Кор_Ш_Шах_ПО17}ОН3-РЭ];[{Кор_Ш_Шах_ПО17}ОН4-КЭ];[{Кор_Ш_Шах_ПО17}ОН4-РЭ];[{Кор_Ш_Шах_ПО17}ОН5-КЭ];[{Кор_Ш_Шах_ПО17}ОН5-РЭ];[{Кор_Ш_Шах_ПО17}ОН6-КЭ];[{Кор_Ш_Шах_ПО17}ОН6-РЭ]]");
                mapUv.put("40", "[[{Кор_Ш_Шах_ПО40}ОН1-КЭ];[{Кор_Ш_Шах_ПО40}ОН1-РЭ];[{Кор_Ш_Шах_ПО40}ОН2-КЭ];[{Кор_Ш_Шах_ПО40}ОН2-РЭ];[{Кор_Ш_Шах_ПО40}ОН3-КЭ];[{Кор_Ш_Шах_ПО40}ОН3-РЭ];[{Кор_Ш_Шах_ПО40}ОН4-КЭ];[{Кор_Ш_Шах_ПО40}ОН4-РЭ];[{Кор_Ш_Шах_ПО40}ОН5-КЭ];[{Кор_Ш_Шах_ПО40}ОН5-РЭ];[{Кор_Ш_Шах_ПО40}ОН6-КЭ];[{Кор_Ш_Шах_ПО40}ОН6-РЭ]]");
                mapUv.put("27", "[[{Кор_Ш_Шах_ПО27}ОН1-КЭ];[{Кор_Ш_Шах_ПО27}ОН1-РЭ];[{Кор_Ш_Шах_ПО27}ОН2-КЭ];[{Кор_Ш_Шах_ПО27}ОН2-РЭ];[{Кор_Ш_Шах_ПО27}ОН3-КЭ];[{Кор_Ш_Шах_ПО27}ОН3-РЭ];[{Кор_Ш_Шах_ПО27}ОН4-КЭ];[{Кор_Ш_Шах_ПО27}ОН4-РЭ];[{Кор_Ш_Шах_ПО27}ОН5-КЭ];[{Кор_Ш_Шах_ПО27}ОН5-РЭ];[{Кор_Ш_Шах_ПО27}ОН6-КЭ];[{Кор_Ш_Шах_ПО27}ОН6-РЭ]]");
                mapUv.put("28", "[[{Кор_Ш_Шах_ПО28}ОН1-КЭ];[{Кор_Ш_Шах_ПО28}ОН1-РЭ];[{Кор_Ш_Шах_ПО28}ОН2-КЭ];[{Кор_Ш_Шах_ПО28}ОН2-РЭ];[{Кор_Ш_Шах_ПО28}ОН3-КЭ];[{Кор_Ш_Шах_ПО28}ОН3-РЭ];[{Кор_Ш_Шах_ПО28}ОН4-КЭ];[{Кор_Ш_Шах_ПО28}ОН4-РЭ];[{Кор_Ш_Шах_ПО28}ОН5-КЭ];[{Кор_Ш_Шах_ПО28}ОН5-РЭ];[{Кор_Ш_Шах_ПО28}ОН6-КЭ];[{Кор_Ш_Шах_ПО28}ОН6-РЭ]]");
                mapUv.put("18", "[[{Кор_Ш_Шах_ПО6}ОН1-КЭ];[{Кор_Ш_Шах_ПО6}ОН1-РЭ];[{Кор_Ш_Шах_ПО6}ОН2-КЭ];[{Кор_Ш_Шах_ПО6}ОН2-РЭ];[{Кор_Ш_Шах_ПО6}ОН3-КЭ];[{Кор_Ш_Шах_ПО6}ОН3-РЭ];[{Кор_Ш_Шах_ПО6}ОН4-КЭ];[{Кор_Ш_Шах_ПО6}ОН4-РЭ];[{Кор_Ш_Шах_ПО6}ОН5-КЭ];[{Кор_Ш_Шах_ПО6}ОН5-РЭ];[{Кор_Ш_Шах_ПО6}ОН6-КЭ];[{Кор_Ш_Шах_ПО6}ОН6-РЭ]]");
                mapUv.put("24", "[[{Кор_Ш_Шах_ПО8}ОН1-КЭ];[{Кор_Ш_Шах_ПО8}ОН1-РЭ];[{Кор_Ш_Шах_ПО8}ОН2-КЭ];[{Кор_Ш_Шах_ПО8}ОН2-РЭ];[{Кор_Ш_Шах_ПО8}ОН3-КЭ];[{Кор_Ш_Шах_ПО8}ОН3-РЭ];[{Кор_Ш_Шах_ПО8}ОН4-КЭ];[{Кор_Ш_Шах_ПО8}ОН4-РЭ];[{Кор_Ш_Шах_ПО8}ОН5-КЭ];[{Кор_Ш_Шах_ПО8}ОН5-РЭ];[{Кор_Ш_Шах_ПО8}ОН6-КЭ];[{Кор_Ш_Шах_ПО8}ОН6-РЭ]]");
                mapUv.put("29", "[[{Кор_Ш_Шах_ПО29}ОН1-КЭ];[{Кор_Ш_Шах_ПО29}ОН1-РЭ];[{Кор_Ш_Шах_ПО29}ОН2-КЭ];[{Кор_Ш_Шах_ПО29}ОН2-РЭ];[{Кор_Ш_Шах_ПО29}ОН3-КЭ];[{Кор_Ш_Шах_ПО29}ОН3-РЭ];[{Кор_Ш_Шах_ПО29}ОН4-КЭ];[{Кор_Ш_Шах_ПО29}ОН4-РЭ];[{Кор_Ш_Шах_ПО29}ОН5-КЭ];[{Кор_Ш_Шах_ПО29}ОН5-РЭ];[{Кор_Ш_Шах_ПО29}ОН6-КЭ];[{Кор_Ш_Шах_ПО29}ОН6-РЭ]]");
                mapUv.put("54", "[[{Кор_Ш_Шах_ПО54}ОН1-КЭ];[{Кор_Ш_Шах_ПО54}ОН1-РЭ];[{Кор_Ш_Шах_ПО54}ОН2-КЭ];[{Кор_Ш_Шах_ПО54}ОН2-РЭ];[{Кор_Ш_Шах_ПО54}ОН3-КЭ];[{Кор_Ш_Шах_ПО54}ОН3-РЭ];[{Кор_Ш_Шах_ПО54}ОН4-КЭ];[{Кор_Ш_Шах_ПО54}ОН4-РЭ];[{Кор_Ш_Шах_ПО54}ОН5-КЭ];[{Кор_Ш_Шах_ПО54}ОН5-РЭ];[{Кор_Ш_Шах_ПО54}ОН6-КЭ];[{Кор_Ш_Шах_ПО54}ОН6-РЭ]]");
                mapUv.put("23", "[[{Кор_Ш_Шах_ПО23}ОН1-КЭ];[{Кор_Ш_Шах_ПО23}ОН1-РЭ];[{Кор_Ш_Шах_ПО23}ОН2-КЭ];[{Кор_Ш_Шах_ПО23}ОН2-РЭ];[{Кор_Ш_Шах_ПО23}ОН3-КЭ];[{Кор_Ш_Шах_ПО23}ОН3-РЭ];[{Кор_Ш_Шах_ПО23}ОН4-КЭ];[{Кор_Ш_Шах_ПО23}ОН4-РЭ];[{Кор_Ш_Шах_ПО23}ОН5-КЭ];[{Кор_Ш_Шах_ПО23}ОН5-РЭ];[{Кор_Ш_Шах_ПО23}ОН6-КЭ];[{Кор_Ш_Шах_ПО23}ОН6-РЭ]]");
                mapUv.put("8", "[[{Кор_Ш_Шах_ПО8}ОН1-КЭ];[{Кор_Ш_Шах_ПО8}ОН1-РЭ];[{Кор_Ш_Шах_ПО8}ОН2-КЭ];[{Кор_Ш_Шах_ПО8}ОН2-РЭ];[{Кор_Ш_Шах_ПО8}ОН3-КЭ];[{Кор_Ш_Шах_ПО8}ОН3-РЭ];[{Кор_Ш_Шах_ПО8}ОН4-КЭ];[{Кор_Ш_Шах_ПО8}ОН4-РЭ];[{Кор_Ш_Шах_ПО8}ОН5-КЭ];[{Кор_Ш_Шах_ПО8}ОН5-РЭ];[{Кор_Ш_Шах_ПО8}ОН6-КЭ];[{Кор_Ш_Шах_ПО8}ОН6-РЭ]]");
                mapUv.put("6", "[[{Кор_Ш_Шах_ПО6}ОН1-КЭ];[{Кор_Ш_Шах_ПО6}ОН1-РЭ];[{Кор_Ш_Шах_ПО6}ОН2-КЭ];[{Кор_Ш_Шах_ПО6}ОН2-РЭ];[{Кор_Ш_Шах_ПО6}ОН3-КЭ];[{Кор_Ш_Шах_ПО6}ОН3-РЭ];[{Кор_Ш_Шах_ПО6}ОН4-КЭ];[{Кор_Ш_Шах_ПО6}ОН4-РЭ];[{Кор_Ш_Шах_ПО6}ОН5-КЭ];[{Кор_Ш_Шах_ПО6}ОН5-РЭ];[{Кор_Ш_Шах_ПО6}ОН6-КЭ];[{Кор_Ш_Шах_ПО6}ОН6-РЭ]]");
                break;
            case "{ВР_БЛ12}":
                mapUv.put("42", "[[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН1+2-Крым];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН1-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН1-КЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН1-РЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН2-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН2-КЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН2-РЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН3-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН3-КЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН3-РЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН4-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН4-КЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН4-РЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН5-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН5-КЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН5-РЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН6-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН6-КЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН6-РЭ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН7-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН8-ВЧ];[{Кор_Ш_В-Р+Б1+Б2_ПО42}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ13}":
                mapUv.put("43", "[[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН1+2-Крым];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН1-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН1-КЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН1-РЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН2-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН2-КЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН2-РЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН3-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН3-КЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН3-РЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН4-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН4-КЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН4-РЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН5-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН5-КЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН5-РЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН6-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН6-КЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН6-РЭ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН7-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН8-ВЧ];[{Кор_Ш_В-Р+Б1+Б3_ПО43}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ23}":
                mapUv.put("44", "[[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН1+2-Крым];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН1-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН1-КЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН1-РЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН2-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН2-КЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН2-РЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН3-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН3-КЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН3-РЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН4-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН4-КЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН4-РЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН5-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН5-КЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН5-РЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН6-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН6-КЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН6-РЭ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН7-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН8-ВЧ];[{Кор_Ш_В-Р+Б2+Б3_ПО44}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ14}":
                mapUv.put("45", "[[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН1+2-Крым];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН1-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН1-КЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН1-РЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН2-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН2-КЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН2-РЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН3-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН3-КЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН3-РЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН4-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН4-КЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН4-РЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН5-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН5-КЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН5-РЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН6-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН6-КЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН6-РЭ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН7-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН8-ВЧ];[{Кор_Ш_В-Р+Б1+Б4_ПО45}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ24}":
                mapUv.put("46", "[[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН1+2-Крым];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН1-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН1-КЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН1-РЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН2-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН2-КЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН2-РЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН3-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН3-КЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН3-РЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН4-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН4-КЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН4-РЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН5-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН5-КЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН5-РЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН6-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН6-КЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН6-РЭ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН7-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН8-ВЧ];[{Кор_Ш_В-Р+Б2+Б4_ПО46}ОН9-ВЧ]]");
                break;
            case "{ВР_БЛ34}":
                mapUv.put("47", "[[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН1+2-Крым];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН1-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН1-КЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН1-РЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН2-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН2-КЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН2-РЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН3-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН3-КЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН3-РЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН4-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН4-КЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН4-РЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН5-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН5-КЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН5-РЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН6-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН6-КЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН6-РЭ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН7-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН8-ВЧ];[{Кор_Ш_В-Р+Б3+Б4_ПО47}ОН9-ВЧ]]");
                break;
            case "{В_БЛ12}":
                mapUv.put("42", "[[{Кор_Ш_Вол+Б1+Б2_ПО42}ОН1+2-Крым];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН1-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН1-КЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН1-РЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН2-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН2-КЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН2-РЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН3-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН3-КЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН3-РЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН4-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН4-КЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН4-РЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН5-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН5-КЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН5-РЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН6-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН6-КЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН6-РЭ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН7-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН8-ВЧ];[{Кор_Ш_Волгогр+Б1+Б2_ПО42}ОН9-ВЧ]]");
                break;
            case "{В_БЛ13}":
                mapUv.put("43", "[[{Кор_Ш_Вол+Б1+Б3_ПО43}ОН1+2-Крым];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН1-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН1-КЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН1-РЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН2-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН2-КЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН2-РЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН3-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН3-КЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН3-РЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН4-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН4-КЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН4-РЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН5-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН5-КЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН5-РЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН6-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН6-КЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН6-РЭ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН7-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН8-ВЧ];[{Кор_Ш_Волгогр+Б1+Б3_ПО43}ОН9-ВЧ]]");
                break;
            case "{В_БЛ23}":
                mapUv.put("44", "[[{Кор_Ш_Вол+Б2+Б3_ПО44}ОН1+2-Крым];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН1-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН1-КЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН1-РЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН2-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН2-КЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН2-РЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН3-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН3-КЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН3-РЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН4-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН4-КЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН4-РЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН5-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН5-КЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН5-РЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН6-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН6-КЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН6-РЭ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН7-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН8-ВЧ];[{Кор_Ш_Волгогр+Б2+Б3_ПО44}ОН9-ВЧ]]");
                break;
            case "{В_БЛ14}":
                mapUv.put("45", "[[{Кор_Ш_Вол+Б1+Б4_ПО45}ОН1+2-Крым];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН1-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН1-КЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН1-РЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН2-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН2-КЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН2-РЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН3-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН3-КЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН3-РЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН4-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН4-КЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН4-РЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН5-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН5-КЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН5-РЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН6-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН6-КЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН6-РЭ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН7-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН8-ВЧ];[{Кор_Ш_Волгогр+Б1+Б4_ПО45}ОН9-ВЧ]]");
                break;
            case "{В_БЛ24}":
                mapUv.put("46", "[[{Кор_Ш_Вол+Б2+Б4_ПО46}ОН1+2-Крым];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН1-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН1-КЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН1-РЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН2-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН2-КЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН2-РЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН3-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН3-КЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН3-РЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН4-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН4-КЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН4-РЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН5-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН5-КЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН5-РЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН6-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН6-КЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН6-РЭ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН7-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН8-ВЧ];[{Кор_Ш_Волгогр+Б2+Б4_ПО46}ОН9-ВЧ]]");
                break;
            case "{В_БЛ34}":
                mapUv.put("47", "[[{Кор_Ш_Вол+Б3+Б4_ПО47}ОН1+2-Крым];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН1-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН1-КЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН1-РЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН2-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН2-КЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН2-РЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН3-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН3-КЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН3-РЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН4-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН4-КЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН4-РЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН5-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН5-КЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН5-РЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН6-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН6-КЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН6-РЭ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН7-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН8-ВЧ];[{Кор_Ш_Волгогр+Б3+Б4_ПО47}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ12}":
                mapUv.put("42", "[[{Кор_Ш_Фр+Б1+Б2_ПО42}ОН1+2-Крым];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН1-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН1-КЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН1-РЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН2-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН2-КЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН2-РЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН3-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН3-КЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН3-РЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН4-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН4-КЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН4-РЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН5-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН5-КЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН5-РЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН6-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН6-КЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН6-РЭ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН7-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН8-ВЧ];[{Кор_Ш_Фрол+Б1+Б2_ПО42}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ13}":
                mapUv.put("43", "[[{Кор_Ш_Фр+Б1+Б3_ПО43}ОН1+2-Крым];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН1-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН1-КЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН1-РЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН2-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН2-КЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН2-РЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН3-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН3-КЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН3-РЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН4-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН4-КЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН4-РЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН5-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН5-КЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН5-РЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН6-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН6-КЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН6-РЭ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН7-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН8-ВЧ];[{Кор_Ш_Фрол+Б1+Б3_ПО43}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ23}":
                mapUv.put("44", "[[{Кор_Ш_Фр+Б2+Б3_ПО44}ОН1+2-Крым];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН1-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН1-КЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН1-РЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН2-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН2-КЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН2-РЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН3-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН3-КЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН3-РЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН4-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН4-КЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН4-РЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН5-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН5-КЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН5-РЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН6-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН6-КЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН6-РЭ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН7-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН8-ВЧ];[{Кор_Ш_Фрол+Б2+Б3_ПО44}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ14}":
                mapUv.put("45", "[[{Кор_Ш_Фр+Б1+Б4_ПО45}ОН1+2-Крым];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН1-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН1-КЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН1-РЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН2-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН2-КЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН2-РЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН3-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН3-КЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН3-РЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН4-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН4-КЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН4-РЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН5-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН5-КЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН5-РЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН6-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН6-КЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН6-РЭ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН7-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН8-ВЧ];[{Кор_Ш_Фрол+Б1+Б4_ПО45}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ24}":
                mapUv.put("46", "[[{Кор_Ш_Фр+Б2+Б4_ПО46}ОН1+2-Крым];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН1-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН1-КЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН1-РЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН2-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН2-КЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН2-РЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН3-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН3-КЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН3-РЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН4-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН4-КЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН4-РЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН5-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН5-КЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН5-РЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН6-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН6-КЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН6-РЭ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН7-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН8-ВЧ];[{Кор_Ш_Фрол+Б2+Б4_ПО46}ОН9-ВЧ]]");
                break;
            case "{Ф_БЛ34}":
                mapUv.put("47", "[[{Кор_Ш_Фр+Б3+Б4_ПО47}ОН1+2-Крым];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН1-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН1-КЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН1-РЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН2-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН2-КЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН2-РЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН3-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН3-КЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН3-РЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН4-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН4-КЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН4-РЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН5-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН5-КЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН5-РЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН6-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН6-КЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН6-РЭ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН7-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН8-ВЧ];[{Кор_Ш_Фрол+Б3+Б4_ПО47}ОН9-ВЧ]]");
                break;

        }
        return mapUv;
    }
    public static String createTableShuntString(String scheme, String poIndex){
        String uv = getMapUv(scheme).get(poIndex);
        System.out.println(scheme);
        System.out.println(poIndex);
        System.out.println(uv);

        String po = getMapPo().get(poIndex);
        System.out.println(po);
        String tsScheme = getMapTs(scheme).get(poIndex);
        System.out.println(tsScheme);
        String tableString = String.join(" ", "*ФСх", tsScheme, po,"*ФСч", uv);
        return tableString;
    }
}
