import org.apache.poi.ss.usermodel.*;
import org.apache.poi.xssf.usermodel.XSSFWorkbook;

import java.io.FileInputStream;
import java.io.IOException;
import java.util.ArrayList;
import java.util.TreeMap;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class ParseExcelTable {
    private static TreeMap<String,String> keyMapUv;
    private static TreeMap<String,String> keyMapPo;
    private static TreeMap<String,String> keyMapTs;

    protected static ArrayList<String> parseExcelTable(String path) throws IOException {
        FileInputStream fis = new FileInputStream(path);

        Workbook workbook;
        try {
            workbook = new XSSFWorkbook(
                    fis);
        } catch (IOException e) {
            throw new RuntimeException(e);
        }
        int count = workbook.getNumberOfSheets();
        ArrayList<Sheet> sheets = new ArrayList<>();
        for (int i = 0; i < count; i++) {
            sheets.add(workbook.getSheetAt(i));
        }
        ArrayList<String> tableUV = new ArrayList<>();
        keyMapPo = getMapPo();
        for (Sheet list : sheets) {

            String schemesKpr = list.getRow(0).getCell(4).getStringCellValue();
            String kpr = getMapKPR(schemesKpr);
            String sezon = list.getRow(0).getCell(0).getStringCellValue();
            String schemesGroup = getMapGroup(schemesKpr);
            System.out.println(schemesGroup);
            String sezonGroup;
            if (sezon.toLowerCase().contains("лето")){
                sezonGroup ="Текущий_сезон=ЛЕТО";
            }else {
                sezonGroup ="Текущий_сезон=ЗИМА";
            }
            keyMapUv = getMapUv(schemesGroup, sezonGroup);
            for (Row row : list) {
                String cellValue = row.getCell(0).getStringCellValue();
                if (cellValue.contains("Нормальная схема")) {
                    String keyNameScheme = "[Нормальная_схема" + schemesGroup + "]";
                    tableUV.add(createTableString(schemesGroup,sezonGroup, row, keyNameScheme,kpr));
                } else if (cellValue.contains("или")) {
                    String[] schemesFrag = cellValue.split("или");
                    for (String frag : schemesFrag) {
                        if (!frag.isEmpty()) {
                            String nameScheme = modifiedNameSchemes(frag);
                            String keyNameScheme = "[" + nameScheme + schemesGroup + "]";
                            tableUV.add(createTableString(schemesGroup,sezonGroup, row, keyNameScheme,kpr));
                        }
                    }
                } else if (!modifiedNameSchemes(cellValue).isEmpty()) {
                    String nameScheme = modifiedNameSchemes(cellValue);
                    String keyNameScheme = nameScheme + schemesGroup;
                    tableUV.add(createTableString(schemesGroup,sezonGroup, row, keyNameScheme,kpr));
                }
            }
        }
        fis.close();
        return tableUV;
    }

    public static String modifiedNameSchemes(String name) {
        String regex = "\\(([^)]+)\\)";
        Pattern pattern = Pattern.compile(regex);
        Matcher matcher = pattern.matcher(name);
        String modifiedNameSchemes = "";
        while (matcher.find()) {
            modifiedNameSchemes = matcher.group(1).replaceAll("\\s+","");
        }
        return modifiedNameSchemes;
    }
    public static String getMapGroup(String schemesKpr){
        String schemesGroup = "";
        if (schemesKpr.contains("«Волгоград-Ростов»")) {
            schemesGroup = "{ВР}";
        } else if (schemesKpr.contains("«Волгоград-Ростов+Блок 1»")) {
            schemesGroup = "{ВР_БЛ1}";
        } else if (schemesKpr.contains("«Волгоград-Ростов+Блок 2»")) {
            schemesGroup = "{ВР_БЛ2}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+Блок 3»")) {
            schemesGroup = "{ВР_БЛ3}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+Блок 4»")) {
            schemesGroup = "{ВР_БЛ4}";
        }else if (schemesKpr.contains("«Ростов-Волгоград»")) {
            schemesGroup = "{РВ}";
        }else if (schemesKpr.contains("«Ростов-Волгоград+ВЛ 500 кВ Победа - Шахты»")) {
            schemesGroup = "{РВ_ПШ}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 1»")) {
            schemesGroup = "{В_БЛ1}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 2»")) {
            schemesGroup = "{В_БЛ2}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 3»")) {
            schemesGroup = "{В_БЛ3}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 4»")) {
            schemesGroup = "{В_БЛ4}";
        }else if (schemesKpr.contains("«Фроловское +Блок 1»")) {
            schemesGroup = "{Ф_БЛ1}";
        }else if (schemesKpr.contains("«Фроловское +Блок 2»")) {
            schemesGroup = "{Ф_БЛ2}";
        }else if (schemesKpr.contains("«Фроловское +Блок 3»")) {
            schemesGroup = "{Ф_БЛ3}";
        }else if (schemesKpr.contains("«Фроловское +Блок 4»")) {
            schemesGroup = "{Ф_БЛ4}";
        }else if (schemesKpr.contains("«Волгоградское из ОЭС Юга+ ВЛ 500 кВ Победа - Шахты»")) {
            schemesGroup = "{В_ПШ}";
        }else if (schemesKpr.contains("«Фроловское из ОЭС Юга+ ВЛ 500 кВ Победа - Шахты»")) {
            schemesGroup = "{Ф_ПШ}";
        }else if (schemesKpr.contains("«Север»")) {
            schemesGroup = "{С}";
        }else if (schemesKpr.contains("«Шахты»")) {
            schemesGroup = "{Ш}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+ Блок 1+Блок 2»")) {
            schemesGroup = "{ВР_БЛ12}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+ Блок 1+Блок 3»")) {
            schemesGroup = "{ВР_БЛ13}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+ Блок 1+Блок 4»")) {
            schemesGroup = "{ВР_БЛ14}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+ Блок 2+Блок 3»")) {
            schemesGroup = "{ВР_БЛ23}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+ Блок 2+Блок 4»")) {
            schemesGroup = "{ВР_БЛ24}";
        }else if (schemesKpr.contains("«Волгоград-Ростов+ Блок 3+Блок 4»")) {
            schemesGroup = "{ВР_БЛ34}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 1 + Блок 2»")) {
            schemesGroup = "{В_БЛ12}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 1 + Блок 3»")) {
            schemesGroup = "{В_БЛ13}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 2 + Блок 3»")) {
            schemesGroup = "{В_БЛ23}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 1 + Блок 4»")) {
            schemesGroup = "{В_БЛ14}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 2 + Блок 4»")) {
            schemesGroup = "{В_БЛ24}";
        }else if (schemesKpr.contains("«Волгоградское+Блок 3 + Блок 4»")) {
            schemesGroup = "{В_БЛ34}";
        }else if (schemesKpr.contains("«Фроловское +Блок 1 +Блок 2»")) {
            schemesGroup = "{Ф_БЛ12}";
        }else if (schemesKpr.contains("«Фроловское +Блок 1 +Блок 3»")) {
            schemesGroup = "{Ф_БЛ13}";
        }else if (schemesKpr.contains("«Фроловское +Блок 2 +Блок 3»")) {
            schemesGroup = "{Ф_БЛ23}";
        }else if (schemesKpr.contains("«Фроловское +Блок 1 +Блок 4»")) {
            schemesGroup = "{Ф_БЛ14}";
        }else if (schemesKpr.contains("«Фроловское +Блок 2 +Блок 4»")) {
            schemesGroup = "{Ф_БЛ24}";
        }else if (schemesKpr.contains("«Фроловское +Блок 3 +Блок 4»")) {
            schemesGroup = "{Ф_БЛ34}";
        }
        return schemesGroup;
    }
    public static String getMapKPR (String schemesKpr){
        String kpr = null;
        switch (schemesKpr){
            case "КПР-1 «Фроловское +Блок 1» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-1";
                break;
            case "КПР-2 «Фроловское +Блок 1» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-1";
                break;
            case "КПР-1 «Фроловское +Блок 2» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-2";
                break;
            case "КПР-2 «Фроловское +Блок 2» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-2";
                break;
            case "КПР-1 «Фроловское +Блок 3» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-3";
                break;
            case "КПР-2 «Фроловское +Блок 3» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-3";
                break;
            case "КПР-1 «Фроловское +Блок 4» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-4";
                break;
            case "КПР-2 «Фроловское +Блок 4» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-4";
                break;
            case "КПР-1 «Фроловское +Блок 1 +Блок 2» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-1+Бл-2";
                break;
            case "КПР-2 «Фроловское +Блок 1 +Блок 2» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-1+Бл-2";
                break;
            case "КПР-1 «Фроловское +Блок 1 +Блок 3» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-1+Бл-3";
                break;
            case "КПР-2 «Фроловское +Блок 1 +Блок 3» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-1+Бл-3";
                break;
            case "КПР-1 «Фроловское +Блок 1 +Блок 4» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-1+Бл-4";
                break;
            case "КПР-2 «Фроловское +Блок 1 +Блок 4» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-1+Бл-4";
                break;
            case "КПР-1 «Фроловское +Блок 2 +Блок 3» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-2+Бл-3";
                break;
            case "КПР-2 «Фроловское +Блок 2 +Блок 3» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-2+Бл-3";
                break;
            case "КПР-1 «Фроловское +Блок 2 +Блок 4» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-2+Бл-4";
                break;
            case "КПР-2 «Фроловское +Блок 2 +Блок 4» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-2+Бл-4";
                break;
            case "КПР-1 «Фроловское +Блок 3 +Блок 4» МВт/ступень":
                kpr="КПР-1_Фроловское+Бл-3+Бл-4";
                break;
            case "КПР-2 «Фроловское +Блок 3 +Блок 4» МВт/ступень":
                kpr="КПР-2_Фроловское+Бл-3+Бл-4";
                break;
            case "КПР-1 «Фроловское из ОЭС Юга+ ВЛ 500 кВ Победа - Шахты» МВт/ступень":
                kpr="КПР1_Фроловское_из_ОЭС_Юга+ПШ";
                break;
            case "КПР-2 «Фроловское из ОЭС Юга+ ВЛ 500 кВ Победа - Шахты» МВт/ступень":
                kpr="КПР2_Фроловское_из_ОЭС_Юга+ПШ";
                break;
            case "КПР-1 «Ростов-Волгоград» МВт/ступень":
                kpr="КПР-1_Ростов-Волгоград";
                break;
            case "КПР-2 «Ростов-Волгоград» МВт/ступень":
                kpr="КПР-2_Ростов-Волгоград";
                break;
            case "КПР-1 «Ростов-Волгоград+ВЛ 500 кВ Победа - Шахты» МВт/ступень":
                kpr="КПР-1_Ростов-Волгоград+ПШ";
                break;
            case "КПР-2 «Ростов-Волгоград+ВЛ 500 кВ Победа - Шахты» МВт/ступень":
                kpr="КПР-2_Ростов-Волгоград+ПШ";
                break;
            case "КПР-1 «Север» МВт/ступень":
                kpr="КПР-1_Север";
                break;
            case "КПР-2 «Север» МВт/ступень":
                kpr="КПР-2_Север";
                break;
            case "КПР-3 «Север» МВт/ступень":
                kpr="КПР-3_Север";
                break;
            case "КПР-4 «Север» МВт/ступень":
                kpr="КПР-4_Север";
                break;
            case "КПР-5 «Север» МВт/ступень":
                kpr="КПР-5_Север";
                break;
            case "КПР-6 «Север» МВт/ступень":
                kpr="КПР-6_Север";
                break;
            case "КПР-7 «Север» МВт/ступень":
                kpr="КПР-7_Север";
                break;
            case "КПР-8 «Север» МВт/ступень":
                kpr="КПР-8_Север";
                break;
            case "КПР-9 «Север» МВт/ступень":
                kpr="КПР-9_Север";
                break;
            case "КПР-10 «Север» МВт/ступень":
                kpr="КПР-10_Север";
                break;
            case "КПР-11 «Север» МВт/ступень":
                kpr="КПР-11_Север";
                break;
            case "КПР-12 «Север» МВт/ступень":
                kpr="КПР-12_Север";
                break;
            case "КПР-13 «Север» МВт/ступень":
                kpr="КПР-13_Север";
                break;
            case "КПР-14 «Север» МВт/ступень":
                kpr="КПР-14_Север";
                break;
            case "КПР-15 «Север» МВт/ступень":
                kpr="КПР-15_Север";
                break;
            case "КПР-16 «Север» МВт/ступень":
                kpr="КПР-16_Север";
                break;
            case "КПР-17 «Север» МВт/ступень":
                kpr="КПР-17_Север";
                break;
            case "КПР-18 «Север» МВт/ступень":
                kpr="КПР-18_Север";
                break;
            case "КПР-19 «Север» МВт/ступень":
                kpr="КПР-19_Север";
                break;
            case "КПР-20 «Север» МВт/ступень":
                kpr="КПР-20_Север";
                break;
            case "КПР-21 «Север» МВт/ступень":
                kpr="КПР-21_Север";
                break;
            case "КПР-22 «Север» МВт/ступень":
                kpr="КПР-22_Север";
                break;
            case "КПР-23 «Север» МВт/ступень":
                kpr="КПР-23_Север";
                break;
            case "КПР-24 «Север» МВт/ступень":
                kpr="КПР-24_Север";
                break;
            case "КПР-25 «Север» МВт/ступень":
                kpr="КПР-25_Север";
                break;
            case "КПР-26 «Север» МВт/ступень":
                kpr="КПР-26_Север";
                break;
            case "КПР-27 «Север» МВт/ступень":
                kpr="КПР-27_Север";
                break;
            case "КПР-28 «Север» МВт/ступень":
                kpr="КПР-28_Север";
                break;
            case "КПР-29 «Север» МВт/ступень":
                kpr="КПР-29_Север";
                break;
            case "КПР-30 «Север» МВт/ступень":
                kpr="КПР-30_Север";
                break;
            case "КПР-31 «Север» МВт/ступень":
                kpr="КПР-31_Север";
                break;
            case "КПР-32 «Север» МВт/ступень":
                kpr="КПР-32_Север";
                break;
            case "КПР-33 «Север» МВт/ступень":
                kpr="КПР-33_Север";
                break;
            case "КПР-34 «Север» МВт/ступень":
                kpr="КПР-34_Север";
                break;
            case "КПР-35 «Север» МВт/ступень":
                kpr="КПР-35_Север";
                break;
            case "КПР-36 «Север» МВт/ступень":
                kpr="КПР-36_Север";
                break;
            case "КПР-37 «Север» МВт/ступень":
                kpr="КПР-37_Север";
                break;
            case "КПР-38 «Север» МВт/ступень":
                kpr="КПР-38_Север";
                break;
            case "КПР-39 «Север» МВт/ступень":
                kpr="КПР-39_Север";
                break;
            case "КПР-40 «Север» МВт/ступень":
                kpr="КПР-40_Север";
                break;
            case "КПР-41 «Север» МВт/ступень":
                kpr="КПР-41_Север";
                break;
            case "КПР-42 «Север» МВт/ступень":
                kpr="КПР-42_Север";
                break;
            case "КПР-43 «Север» МВт/ступень":
                kpr="КПР-43_Север";
                break;
            case "КПР-44 «Север» МВт/ступень":
                kpr="КПР-44_Север";
                break;
            case "КПР-45 «Север» МВт/ступень":
                kpr="КПР-45_Север";
                break;
            case "КПР-46 «Север» МВт/ступень":
                kpr="КПР-46_Север";
                break;
            case "КПР-47 «Север» МВт/ступень":
                kpr="КПР-47_Север";
                break;
            case "КПР-48 «Север» МВт/ступень":
                kpr="КПР-48_Север";
                break;
            case "КПР-49 «Север» МВт/ступень":
                kpr="КПР-49_Север";
                break;
            case "КПР-50 «Север» МВт/ступень":
                kpr="КПР-50_Север";
                break;
            case "КПР-51 «Север» МВт/ступень":
                kpr="КПР-51_Север";
                break;
            case "КПР-52 «Север» МВт/ступень":
                kpr="КПР-52_Север";
                break;
            case "КПР-53 «Север» МВт/ступень":
                kpr="КПР-53_Север";
                break;
            case "КПР-54 «Север» МВт/ступень":
                kpr="КПР-54_Север";
                break;
            case "КПР-55 «Север» МВт/ступень":
                kpr="КПР-55_Север";
                break;
            case "КПР-56 «Север» МВт/ступень":
                kpr="КПР-56_Север";
                break;
            case "КПР-57 «Север» МВт/ступень":
                kpr="КПР-57_Север";
                break;
            case "КПР-58 «Север» МВт/ступень":
                kpr="КПР-58_Север";
                break;
            case "КПР-59 «Север» МВт/ступень":
                kpr="КПР-59_Север";
                break;
            case "КПР-60 «Север» МВт/ступень":
                kpr="КПР-60_Север";
                break;
            case "КПР-61 «Север» МВт/ступень":
                kpr="КПР-61_Север";
                break;
            case "КПР-62 «Север» МВт/ступень":
                kpr="КПР-62_Север";
                break;
            case "КПР-63 «Север» МВт/ступень":
                kpr="КПР-63_Север";
                break;
            case "КПР-64 «Север» МВт/ступень":
                kpr="КПР-64_Север";
                break;
            case "КПР-65 «Север» МВт/ступень":
                kpr="КПР-65_Север";
                break;
            case "КПР-66 «Север» МВт/ступень":
                kpr="КПР-66_Север";
                break;
            case "КПР-67 «Север» МВт/ступень":
                kpr="КПР-67_Север";
                break;
            case "КПР-68 «Север» МВт/ступень":
                kpr="КПР-68_Север";
                break;
            case "КПР-69 «Север» МВт/ступень":
                kpr="КПР-69_Север";
                break;
            case "КПР-70 «Север» МВт/ступень":
                kpr="КПР-70_Север";
                break;
            case "КПР-71 «Север» МВт/ступень":
                kpr="КПР-71_Север";
                break;
            case "КПР-72 «Север» МВт/ступень":
                kpr="КПР-72_Север";
                break;
            case "КПР-73 «Север» МВт/ступень":
                kpr="КПР-73_Север";
                break;
            case "КПР-74 «Север» МВт/ступень":
                kpr="КПР-74_Север";
                break;
            case "КПР-75 «Север» МВт/ступень":
                kpr="КПР-75_Север";
                break;
            case "КПР-76 «Север» МВт/ступень":
                kpr="КПР-76_Север";
                break;
            case "КПР-77 «Север» МВт/ступень":
                kpr="КПР-77_Север";
                break;
            case "КПР-78 «Север» МВт/ступень":
                kpr="КПР-78_Север";
                break;
            case "КПР-79 «Север» МВт/ступень":
                kpr="КПР-79_Север";
                break;
            case "КПР-80 «Север» МВт/ступень":
                kpr="КПР-80_Север";
                break;
            case "КПР-81 «Север» МВт/ступень":
                kpr="КПР-81_Север";
                break;
            case "КПР-82 «Север» МВт/ступень":
                kpr="КПР-82_Север";
                break;
            case "КПР-83 «Север» МВт/ступень":
                kpr="КПР-83_Север";
                break;
            case "КПР-84 «Север» МВт/ступень":
                kpr="КПР-84_Север";
                break;
            case "КПР-85 «Север» МВт/ступень":
                kpr="КПР-85_Север";
                break;
            case "КПР-86 «Север» МВт/ступень":
                kpr="КПР-86_Север";
                break;
            case "КПР-87 «Север» МВт/ступень":
                kpr="КПР-87_Север";
                break;
            case "КПР-88 «Север» МВт/ступень":
                kpr="КПР-88_Север";
                break;
            case "КПР-89 «Север» МВт/ступень":
                kpr="КПР-89_Север";
                break;
            case "КПР-90 «Север» МВт/ступень":
                kpr="КПР-90_Север";
                break;
            case "КПР-91 «Север» МВт/ступень":
                kpr="КПР-91_Север";
                break;
            case "КПР-92 «Север» МВт/ступень":
                kpr="КПР-92_Север";
                break;
            case "КПР-93 «Север» МВт/ступень":
                kpr="КПР-93_Север";
                break;
            case "КПР-94 «Север» МВт/ступень":
                kpr="КПР-94_Север";
                break;
            case "КПР-95 «Север» МВт/ступень":
                kpr="КПР-95_Север";
                break;
            case "КПР-96 «Север» МВт/ступень":
                kpr="КПР-96_Север";
                break;
            case "КПР-97 «Север» МВт/ступень":
                kpr="КПР-97_Север";
                break;
            case "КПР-98 «Север» МВт/ступень":
                kpr="КПР-98_Север";
                break;
            case "КПР-99 «Север» МВт/ступень":
                kpr="КПР-99_Север";
                break;
            case "КПР-100 «Север» МВт/ступень":
                kpr="КПР-100_Север";
                break;
            case "КПР-101 «Север» МВт/ступень":
                kpr="КПР-101_Север";
                break;
            case "КПР-102 «Север» МВт/ступень":
                kpr="КПР-102_Север";
                break;
            case "КПР-103 «Север» МВт/ступень":
                kpr="КПР-103_Север";
                break;
            case "КПР-104 «Север» МВт/ступень":
                kpr="КПР-104_Север";
                break;
            case "КПР-105 «Север» МВт/ступень":
                kpr="КПР-105_Север";
                break;
            case "КПР-106 «Север» МВт/ступень":
                kpr="КПР-106_Север";
                break;
            case "КПР-107 «Север» МВт/ступень":
                kpr="КПР-107_Север";
                break;
            case "КПР-108 «Север» МВт/ступень":
                kpr="КПР-108_Север";
                break;
            case "КПР-109 «Север» МВт/ступень":
                kpr="КПР-109_Север";
                break;
            case "КПР-110 «Север» МВт/ступень":
                kpr="КПР-110_Север";
                break;
            case "КПР-111 «Север» МВт/ступень":
                kpr="КПР-111_Север";
                break;
            case "КПР-112 «Север» МВт/ступень":
                kpr="КПР-112_Север";
                break;
            case "КПР-113 «Север» МВт/ступень":
                kpr="КПР-113_Север";
                break;
            case "КПР-114 «Север» МВт/ступень":
                kpr="КПР-114_Север";
                break;
            case "КПР-115 «Север» МВт/ступень":
                kpr="КПР-115_Север";
                break;
            case "КПР-116 «Север» МВт/ступень":
                kpr="КПР-116_Север";
                break;
            case "КПР-117 «Север» МВт/ступень":
                kpr="КПР-117_Север";
                break;
            case "КПР-118 «Север» МВт/ступень":
                kpr="КПР-118_Север";
                break;
            case "КПР-119 «Север» МВт/ступень":
                kpr="КПР-119_Север";
                break;
            case "КПР-120 «Север» МВт/ступень":
                kpr="КПР-120_Север";
                break;
            case "КПР-121 «Север» МВт/ступень":
                kpr="КПР-121_Север";
                break;
            case "КПР-122 «Север» МВт/ступень":
                kpr="КПР-122_Север";
                break;
            case "КПР-123 «Север» МВт/ступень":
                kpr="КПР-123_Север";
                break;
            case "КПР-124 «Север» МВт/ступень":
                kpr="КПР-124_Север";
                break;
            case "КПР-125 «Север» МВт/ступень":
                kpr="КПР-125_Север";
                break;
            case "КПР-126 «Север» МВт/ступень":
                kpr="КПР-126_Север";
                break;
            case "КПР-127 «Север» МВт/ступень":
                kpr="КПР-127_Север";
                break;
            case "КПР-1 «Шахты» МВт/ступень":
                kpr="КПР-1_Шахты";
                break;
            case "КПР-2 «Шахты» МВт/ступень":
                kpr="КПР-2_Шахты";
                break;
            case "КПР-3 «Шахты» МВт/ступень":
                kpr="КПР-3_Шахты";
                break;
            case "КПР-4 «Шахты» МВт/ступень":
                kpr="КПР-4_Шахты";
                break;
            case "КПР-5 «Шахты» МВт/ступень":
                kpr="КПР-5_Шахты";
                break;
            case "КПР-6 «Шахты» МВт/ступень":
                kpr="КПР-6_Шахты";
                break;
            case "КПР-7 «Шахты» МВт/ступень":
                kpr="КПР-7_Шахты";
                break;
            case "КПР-8 «Шахты» МВт/ступень":
                kpr="КПР-8_Шахты";
                break;
            case "КПР-9 «Шахты» МВт/ступень":
                kpr="КПР-9_Шахты";
                break;
            case "КПР-10 «Шахты» МВт/ступень":
                kpr="КПР-10_Шахты";
                break;
            case "КПР-11 «Шахты» МВт/ступень":
                kpr="КПР-11_Шахты";
                break;
            case "КПР-12 «Шахты» МВт/ступень":
                kpr="КПР-12_Шахты";
                break;
            case "КПР-13 «Шахты» МВт/ступень":
                kpr="КПР-13_Шахты";
                break;
            case "КПР-14 «Шахты» МВт/ступень":
                kpr="КПР-14_Шахты";
                break;
            case "КПР-15 «Шахты» МВт/ступень":
                kpr="КПР-15_Шахты";
                break;
            case "КПР-16 «Шахты» МВт/ступень":
                kpr="КПР-16_Шахты";
                break;
            case "КПР-17 «Шахты» МВт/ступень":
                kpr="КПР-17_Шахты";
                break;
            case "КПР-18 «Шахты» МВт/ступень":
                kpr="КПР-18_Шахты";
                break;
            case "КПР-19 «Шахты» МВт/ступень":
                kpr="КПР-19_Шахты";
                break;
            case "КПР-20 «Шахты» МВт/ступень":
                kpr="КПР-20_Шахты";
                break;
            case "КПР-21 «Шахты» МВт/ступень":
                kpr="КПР-21_Шахты";
                break;
            case "КПР-22 «Шахты» МВт/ступень":
                kpr="КПР-22_Шахты";
                break;
            case "КПР-23 «Шахты» МВт/ступень":
                kpr="КПР-23_Шахты";
                break;
            case "КПР-24 «Шахты» МВт/ступень":
                kpr="КПР-24_Шахты";
                break;
            case "КПР-25 «Шахты» МВт/ступень":
                kpr="КПР-25_Шахты";
                break;
            case "КПР-26 «Шахты» МВт/ступень":
                kpr="КПР-26_Шахты";
                break;
            case "КПР-27 «Шахты» МВт/ступень":
                kpr="КПР-27_Шахты";
                break;
            case "КПР-28 «Шахты» МВт/ступень":
                kpr="КПР-28_Шахты";
                break;
            case "КПР-29 «Шахты» МВт/ступень":
                kpr="КПР-29_Шахты";
                break;
            case "КПР-1 «Волгоградское+Блок 1» МВт/ступень":
                kpr="КПР1_Волгоградское+Бл-1";
                break;
            case "КПР-2 «Волгоградское+Блок 1» МВт/ступень":
                kpr="КПР2_Волгоградское+Бл-1";
                break;
            case "КПР-1 «Волгоградское+Блок 2» МВт/ступень":
                kpr="КПР1_Волгоградское+Бл-2";
                break;
            case "КПР-2 «Волгоградское+Блок 2» МВт/ступень":
                kpr="КПР2_Волгоградское+Бл-2";
                break;
            case "КПР-1 «Волгоградское+Блок 3» МВт/ступень":
                kpr="КПР1_Волгоградское+Бл-3";
                break;
            case "КПР-2 «Волгоградское+Блок 3» МВт/ступень":
                kpr="КПР2_Волгоградское+Бл-3";
                break;
            case "КПР-1 «Волгоградское+Блок 4» МВт/ступень":
                kpr="КПР1_Волгоградское+Бл-4";
                break;
            case "КПР-2 «Волгоградское+Блок 4» МВт/ступень":
                kpr="КПР2_Волгоградское+Бл-4";
                break;
            case "КПР-1 «Волгоградское+Блок 1 + Блок 2» МВт/ступень":
                kpr="КПР-1_Волгоградское+Бл-1+Бл-2";
                break;
            case "КПР-2 «Волгоградское+Блок 1 + Блок 2» МВт/ступень":
                kpr="КПР-2_Волгоградское+Бл-1+Бл-2";
                break;
            case "КПР-1 «Волгоградское+Блок 1 + Блок 3» МВт/ступень":
                kpr="КПР-1_Волгоградское+Бл-1+Бл-3";
                break;
            case "КПР-2 «Волгоградское+Блок 1 + Блок 3» МВт/ступень":
                kpr="КПР-2_Волгоградское+Бл-1+Бл-3";
                break;
            case "КПР-1 «Волгоградское+Блок 1 + Блок 4» МВт/ступень":
                kpr="КПР-1_Волгоградское+Бл-1+Бл-4";
                break;
            case "КПР-2 «Волгоградское+Блок 1 + Блок 4» МВт/ступень":
                kpr="КПР-2_Волгоградское+Бл-1+Бл-4";
                break;
            case "КПР-1 «Волгоградское+Блок 2 + Блок 3» МВт/ступень":
                kpr="КПР-1_Волгоградское+Бл-2+Бл-3";
                break;
            case "КПР-2 «Волгоградское+Блок 2 + Блок 3» МВт/ступень":
                kpr="КПР-2_Волгоградское+Бл-2+Бл-3";
                break;
            case "КПР-1 «Волгоградское+Блок 2 + Блок 4» МВт/ступень":
                kpr="КПР-1_Волгоградское+Бл-2+Бл-4";
                break;
            case "КПР-2 «Волгоградское+Блок 2 + Блок 4» МВт/ступень":
                kpr="КПР-2_Волгоградское+Бл-2+Бл-4";
                break;
            case "КПР-1 «Волгоградское+Блок 3 + Блок 4» МВт/ступень":
                kpr="КПР-1_Волгоградское+Бл-3+Бл-4";
                break;
            case "КПР-2 «Волгоградское+Блок 3 + Блок 4» МВт/ступень":
                kpr="КПР-2_Волгоградское+Бл-3+Бл-4";
                break;
            case "КПР-1 «Волгоградское из ОЭС Юга+ ВЛ 500 кВ Победа - Шахты» МВт/ступень":
                kpr="КПР1_Волгоградское_из_ОЭС_Юга+ПШ";
                break;
            case "КПР-2 «Волгоградское из ОЭС Юга+ ВЛ 500 кВ Победа - Шахты» МВт/ступень":
                kpr="КПР2_Волгоградское_из_ОЭС_Юга+ПШ";
                break;
            case "КПР-1 «Волгоград-Ростов» МВт/ступень":
                kpr="КПР1_Волгоград-Ростов";
                break;
            case "КПР-2 «Волгоград-Ростов» МВт/ступень":
                kpr="КПР2_Волгоград-Ростов";
                break;
            case "КПР-3 «Волгоград-Ростов» МВт/ступень":
                kpr="КПР3_Волгоград-Ростов";
                break;
            case "КПР-4 «Волгоград-Ростов» МВт/ступень":
                kpr="КПР4_Волгоград-Ростов";
                break;
            case "КПР-1 «Волгоград-Ростов+Блок 1» МВт/ступень":
                kpr="КПР1_Волгоград-Ростов+Бл-1";
                break;
            case "КПР-2 «Волгоград-Ростов+Блок 1» МВт/ступень":
                kpr="КПР2_Волгоград-Ростов+Бл-1";
                break;
            case "КПР-3 «Волгоград-Ростов+Блок 1» МВт/ступень":
                kpr="КПР3_Волгоград-Ростов+Бл-1";
                break;
            case "КПР-1 «Волгоград-Ростов+Блок 2» МВт/ступень":
                kpr="КПР1_Волгоград-Ростов+Бл-2";
                break;
            case "КПР-2 «Волгоград-Ростов+Блок 2» МВт/ступень":
                kpr="КПР2_Волгоград-Ростов+Бл-2";
                break;
            case "КПР-3 «Волгоград-Ростов+Блок 2» МВт/ступень":
                kpr="КПР3_Волгоград-Ростов+Бл-2";
                break;
            case "КПР-1 «Волгоград-Ростов+Блок 3» МВт/ступень":
                kpr="КПР1_Волгоград-Ростов+Бл-3";
                break;
            case "КПР-2 «Волгоград-Ростов+Блок 3» МВт/ступень":
                kpr="КПР2_Волгоград-Ростов+Бл-3";
                break;
            case "КПР-3 «Волгоград-Ростов+Блок 3» МВт/ступень":
                kpr="КПР3_Волгоград-Ростов+Бл-3";
                break;
            case "КПР-1 «Волгоград-Ростов+Блок 4» МВт/ступень":
                kpr="КПР1_Волгоград-Ростов+Бл-4";
                break;
            case "КПР-2 «Волгоград-Ростов+Блок 4» МВт/ступень":
                kpr="КПР2_Волгоград-Ростов+Бл-4";
                break;
            case "КПР-3 «Волгоград-Ростов+Блок 4» МВт/ступень":
                kpr="КПР3_Волгоград-Ростов+Бл-4";
                break;
            case "КПР-1 «Волгоград-Ростов+ Блок 1+Блок 2» МВт/ступень":
                kpr="КПР-1_Волгоград-Ростов+Бл-1+Бл-2";
                break;
            case "КПР-2 «Волгоград-Ростов+ Блок 1+Блок 2» МВт/ступень":
                kpr="КПР-2_Волгоград-Ростов+Бл-1+Бл-2";
                break;
            case "КПР-3 «Волгоград-Ростов+ Блок 1+Блок 2» МВт/ступень":
                kpr="КПР-3_Волгоград-Ростов+Бл-1+Бл-2";
                break;
            case "КПР-4 «Волгоград-Ростов+ Блок 1+Блок 2» МВт/ступень":
                kpr="КПР-4_Волгоград-Ростов+Бл-1+Бл-2";
                break;
            case "КПР-1 «Волгоград-Ростов+ Блок 1+Блок 3» МВт/ступень":
                kpr="КПР-1_Волгоград-Ростов+Бл-1+Бл-3";
                break;
            case "КПР-2 «Волгоград-Ростов+ Блок 1+Блок 3» МВт/ступень":
                kpr="КПР-2_Волгоград-Ростов+Бл-1+Бл-3";
                break;
            case "КПР-3 «Волгоград-Ростов+ Блок 1+Блок 3» МВт/ступень":
                kpr="КПР-3_Волгоград-Ростов+Бл-1+Бл-3";
                break;
            case "КПР-4 «Волгоград-Ростов+ Блок 1+Блок 3» МВт/ступень":
                kpr="КПР-4_Волгоград-Ростов+Бл-1+Бл-3";
                break;
            case "КПР-1 «Волгоград-Ростов+ Блок 2+Блок 3» МВт/ступень":
                kpr="КПР-1_Волгоград-Ростов+Бл-2+Бл-3";
                break;
            case "КПР-2 «Волгоград-Ростов+ Блок 2+Блок 3» МВт/ступень":
                kpr="КПР-2_Волгоград-Ростов+Бл-2+Бл-3";
                break;
            case "КПР-3 «Волгоград-Ростов+ Блок 2+Блок 3» МВт/ступень":
                kpr="КПР-3_Волгоград-Ростов+Бл-2+Бл-3";
                break;
            case "КПР-4 «Волгоград-Ростов+ Блок 2+Блок 3» МВт/ступень":
                kpr="КПР-4_Волгоград-Ростов+Бл-2+Бл-3";
                break;
            case "КПР-1 «Волгоград-Ростов+ Блок 1+Блок 4» МВт/ступень":
                kpr="КПР-1_Волгоград-Ростов+Бл-1+Бл-4";
                break;
            case "КПР-2 «Волгоград-Ростов+ Блок 1+Блок 4» МВт/ступень":
                kpr="КПР-2_Волгоград-Ростов+Бл-1+Бл-4";
                break;
            case "КПР-3 «Волгоград-Ростов+ Блок 1+Блок 4» МВт/ступень":
                kpr="КПР-3_Волгоград-Ростов+Бл-1+Бл-4";
                break;
            case "КПР-4 «Волгоград-Ростов+ Блок 1+Блок 4» МВт/ступень":
                kpr="КПР-4_Волгоград-Ростов+Бл-1+Бл-4";
                break;
            case "КПР-1 «Волгоград-Ростов+ Блок 2+Блок 4» МВт/ступень":
                kpr="КПР-1_Волгоград-Ростов+Бл-2+Бл-4";
                break;
            case "КПР-2 «Волгоград-Ростов+ Блок 2+Блок 4» МВт/ступень":
                kpr="КПР-2_Волгоград-Ростов+Бл-2+Бл-4";
                break;
            case "КПР-3 «Волгоград-Ростов+ Блок 2+Блок 4» МВт/ступень":
                kpr="КПР-3_Волгоград-Ростов+Бл-2+Бл-4";
                break;
            case "КПР-4 «Волгоград-Ростов+ Блок 2+Блок 4» МВт/ступень":
                kpr="КПР-4_Волгоград-Ростов+Бл-2+Бл-4";
                break;
            case "КПР-1 «Волгоград-Ростов+ Блок 3+Блок 4» МВт/ступень":
                kpr="КПР-1_Волгоград-Ростов+Бл-3+Бл-4";
                break;
            case "КПР-2 «Волгоград-Ростов+ Блок 3+Блок 4» МВт/ступень":
                kpr="КПР-2_Волгоград-Ростов+Бл-3+Бл-4";
                break;
            case "КПР-3 «Волгоград-Ростов+ Блок 3+Блок 4» МВт/ступень":
                kpr="КПР-3_Волгоград-Ростов+Бл-3+Бл-4";
                break;
            case "КПР-4 «Волгоград-Ростов+ Блок 3+Блок 4» МВт/ступень":
                kpr="КПР-4_Волгоград-Ростов+Бл-3+Бл-4";
                break;
        }
        return kpr;
    }
    public static TreeMap<String, String> getMapUv(String schemesGroup, String sezonGroup) {
        TreeMap<String, String> mapUv = new TreeMap<>();
        if (schemesGroup.equals("{ВР}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ1}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ1}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ2}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ2}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ3}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ3}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ4}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ4}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{РВ}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{РВ}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{РВ_ПШ}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{РВ_ПШ}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{В_БЛ1}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ1}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ2}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ2}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ3}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ3}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ4}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ4}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ1}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ1}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ2}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ2}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ3}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ3}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ4}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ4}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_ПШ}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{В_ПШ}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        }else if (schemesGroup.equals("{Ф_ПШ}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{Ф_ПШ}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        }else if (schemesGroup.equals("{С}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        } else if (schemesGroup.equals("{С}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОГ150]]");
            mapUv.put("2", "[[УВ_ОГ300]]");
            mapUv.put("3", "[[УВ_Корр_ОГ450]]");
            mapUv.put("4", "[[УВ_Корр_ОГ600]]");
            mapUv.put("5", "[[УВ_Корр_ОГ750]]");
            mapUv.put("6", "[[УВ_Корр_ОГ900]]");
        }else if (schemesGroup.equals("{Ш}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("2", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("3", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("4", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("7", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН3-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("8", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН3-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН3-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("10", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("11", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("12", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("13", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("14", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("15", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("16", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("17", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("18", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН3-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("19", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("20", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("21", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("22", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("23", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("24", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("25", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("26", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("27", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН3-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("28", "[[УВ_ОН1-РЭ]]");
            mapUv.put("29", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("30", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("31", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("32", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("33", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("34", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("35", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("36", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("37", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("38", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН4-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("39", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН4-КЭ];[УВ_ОН3-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("40", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("41", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("42", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("43", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("44", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("45", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("46", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("47", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("48", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("49", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("50", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("51", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("52", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("53", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("54", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("55", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("56", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("57", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("58", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("59", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("60", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("61", "[[УВ_ОН5-РЭ]]");
            mapUv.put("62", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("63", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("64", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("65", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("66", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("67", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("68", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("69", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("70", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("71", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("72", "[[УВ_ОН5-РЭ]]");
            mapUv.put("73", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("74", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("75", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("76", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("77", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("78", "[[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("79", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("80", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("81", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("82", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("83", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН5-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("84", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН5-КЭ];[УВ_ОН4-КЭ];[УВ_ОН1-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("85", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("86", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("87", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("88", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("89", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("90", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("91", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("92", "[[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("93", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("94", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("95", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("96", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("97", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("98", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("99", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("100", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("101", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
        } else if (schemesGroup.equals("{Ш}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("3", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("4", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("5", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("6", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("7", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("8", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН4-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("10", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН4-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("11", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН4-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("12", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН1-КЭ];[УВ_ОН4-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("20", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("21", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("22", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("23", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("24", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("25", "[[УВ_ОН1-РЭ]]");
            mapUv.put("26", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("27", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("28", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("29", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("30", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("31", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("32", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("33", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("34", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("35", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("36", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("37", "[[УВ_ОН1-РЭ]]");
            mapUv.put("38", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("39", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("40", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("41", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("42", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("43", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("44", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("45", "[[УВ_ОН1-РЭ]]");
            mapUv.put("46", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("47", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("48", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("49", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("50", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("51", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("52", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("53", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("54", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("55", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("56", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("57", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("58", "[[УВ_ОН2-РЭ]]");
            mapUv.put("59", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("60", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("61", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("62", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("63", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("64", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("65", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("66", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("67", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("68", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("69", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("70", "[[УВ_ОН5-РЭ]]");
            mapUv.put("71", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("72", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("73", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("74", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("75", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("76", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("77", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("78", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("79", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("80", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("81", "[[УВ_ОН5-РЭ]]");
            mapUv.put("82", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("83", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("84", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("85", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("86", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("87", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("88", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("89", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("90", "[[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("91", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("92", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("93", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("94", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("95", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("96", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("97", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("98", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН3-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("99", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН5-РЭ];[УВ_ОН2-РЭ];[УВ_ОН4-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН3-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("100", "[[УВ_ОН2-РЭ]]");
            mapUv.put("101", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("102", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ]]");
            mapUv.put("103", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("104", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("105", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("106", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("107", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("108", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("109", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("110", "[[УВ_ОН2-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-РЭ];[УВ_ОН5-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("111", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("112", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("113", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("114", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("115", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("116", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("117", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("118", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("119", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("120", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("121", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН3-КЭ];[УВ_ОН6-КЭ]]");
        }else if (schemesGroup.equals("{ВР_БЛ12}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ12}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{ВР_БЛ13}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ13}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{ВР_БЛ23}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ23}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{ВР_БЛ14}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ14}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{ВР_БЛ24}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ24}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{ВР_БЛ34}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{ВР_БЛ34}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ12}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ12}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ13}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ13}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ23}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ23}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ14}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ14}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ24}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ24}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{В_БЛ34}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{В_БЛ34}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ12}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ12}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ13}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ13}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ23}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ23}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ14}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ14}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ24}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ24}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }else if (schemesGroup.equals("{Ф_БЛ34}") && sezonGroup.equals("Текущий_сезон=ЛЕТО")) {
            mapUv.put("1", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        } else if (schemesGroup.equals("{Ф_БЛ34}") && sezonGroup.equals("Текущий_сезон=ЗИМА")) {
            mapUv.put("1", "[[УВ_ОН2-РЭ];[УВ_ОН3-РЭ]]");
            mapUv.put("2", "[[УВ_ОН1-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ]]");
            mapUv.put("3", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ]]");
            mapUv.put("4", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ]]");
            mapUv.put("5", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ]]");
            mapUv.put("6", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ]]");
            mapUv.put("7", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ]]");
            mapUv.put("8", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ]]");
            mapUv.put("9", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ]]");
            mapUv.put("10", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ]]");
            mapUv.put("11", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ]]");
            mapUv.put("12", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ]]");
            mapUv.put("13", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ]]");
            mapUv.put("14", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ]]");
            mapUv.put("15", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ]]");
            mapUv.put("16", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ]]");
            mapUv.put("17", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ]]");
            mapUv.put("18", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ]]");
            mapUv.put("19", "[[УВ_ОН1-РЭ];[УВ_ОН2-РЭ];[УВ_ОН3-РЭ];[УВ_ОН4-РЭ];[УВ_ОН5-РЭ];[УВ_ОН6-РЭ];[УВ_ОН1-КЭ];[УВ_ОН2-КЭ];[УВ_ОН3-КЭ];[УВ_ОН4-КЭ];[УВ_ОН5-КЭ];[УВ_ОН6-КЭ];[УВ_ОН1-ВЧ];[УВ_ОН2-ВЧ];[УВ_ОН3-ВЧ];[УВ_ОН4-ВЧ];[УВ_ОН5-ВЧ];[УВ_ОН6-ВЧ];[УВ_ОН7-ВЧ];[УВ_ОН8-ВЧ];[УВ_ОН9-ВЧ]]");
        }
        return mapUv;
    }
    public static TreeMap<String, String> getMapPo(){
        TreeMap<String, String> mapPo = new TreeMap<>();
        mapPo.put("1", "ФОЛ_500кВ_РоАЭС–Шахты");
        mapPo.put("2", "ФОЛ_500кВ_РоАЭС–Ростовская");
        mapPo.put("3", "ФОЛ_500кВ_РоАЭС–Георг");
        mapPo.put("4", "ФОЛ_500кВ_Фроловская–Шахты");
        mapPo.put("5", "ФОЛ_500кВ_Победа–Шахты");
        mapPo.put("6", "ФОЛ_500кВ_Балашовская–Фроловская");
        mapPo.put("7", "ФО_АТ-1_500/220кВ_РоАЭС");
        mapPo.put("8", "ФОЛ_500кВ_ВолжскаяГЭС-Фроловская");
        mapPo.put("10", "ФОЛ_330кВ_НчГРЭС–Тихорецк");
        mapPo.put("11", "ФО_Блока_1_Ростовской_АЭС");
        mapPo.put("12", "ФОДЛ_500кВ_Волга-Георг-Трубная");
        mapPo.put("13", "ФОЛ_РоАЭС-Ростов_и_ФОАТ1_РоАЭС");
        mapPo.put("14", "ФОЛ_500кВ_Шахты–Ростовская");
        mapPo.put("15", "ФОАТ-3_500/220кВ_ПС_Шахты");
        mapPo.put("16", "ФОАТ-4_500/220кВ_ПС_Шахты");
        mapPo.put("17", "ФОАТГ-1_500/220кВ_ПС_Ростовская");
        mapPo.put("18", "ФОЛ_500кВ_Балашовская–Фроловская");
        mapPo.put("20", "ФО_Блока_2_Ростовской_АЭС");
        mapPo.put("22", "ФО_Блока_3_Ростовской_АЭС");
        mapPo.put("23", "ФО_Блока_4_Ростовской_АЭС");
        mapPo.put("24", "ФОЛ_500кВ_ВолжскаяГЭС-Фроловская");
        mapPo.put("25", "ФОЛ_500кВ_Шахты–Ростовская");
        mapPo.put("26", "ФОЛ_500кВ_РоАЭС–Шахты");
        mapPo.put("27", "ФО_III_СШ_500кВ_РоАЭС");
        mapPo.put("28", "ФО_IV_СШ_500кВ_РоАЭС");
        mapPo.put("29", "ФО_СШ_500кВ_Шахты");
        mapPo.put("30", "ФОЛ_220_Заливская-ГОК");
        mapPo.put("31", "ФОЛ_220_Волгодонск-ГОК");
        mapPo.put("32", "ФОЛтр-таВолгодонск-ГОК-Заливская");
        mapPo.put("33", "ФОЛ_220_РоАЭС-Котельниково");
        mapPo.put("34", "ФОЛ_220_Заливская-Котельниково");
        mapPo.put("35", "ФОЛтр-таРоАЭС-Котельн-Заливская");
        mapPo.put("36", "ФОЛ_220_Арчеда-Сатаровская");
        mapPo.put("37", "ФОЛ_220_СатаровскаяАндреановская");
        mapPo.put("38", "ФОЛ_220_Андреановская-Вешенская2");
        mapPo.put("39", "ФОЛ_220_Вешенская2-Б10");
        mapPo.put("40", "ФОЛтр-таАрчеда-Б10");
        mapPo.put("41", "ФОЛ_220_Волга-Заливская");
        mapPo.put("42", "ФО_Блок1+Блок2");
        mapPo.put("43", "ФО_Блок1+Блок3");
        mapPo.put("44", "ФО_Блок2+Блок3");
        mapPo.put("45", "ФО_Блок1+Блок4");
        mapPo.put("46", "ФО_Блок2+Блок4");
        mapPo.put("47", "ФО_Блок3+Блок4");
        mapPo.put("48", "ФО_Блок1+ФО_III_СШ_РоАЭС");
        mapPo.put("49", "ФО_Блок2+ФО_IV_СШ_РоАЭС");
        mapPo.put("50", "ФО_Блок3+ФО_III_СШ_РоАЭС");
        mapPo.put("51", "ФО_Блок3+ФО_IV_СШ_РоАЭС");
        mapPo.put("52", "ФО_Блок4+ФО_III_СШ_РоАЭС");
        mapPo.put("53", "ФО_Блок4+ФО_IV_СШ_РоАЭС");
        mapPo.put("54", "ФО_Блок4+ФОЛ_РоАЭС-Шахты");
        mapPo.put("55", "ФОЛ_РоАЭС-Георг+РоАЭС-Буден");
        mapPo.put("56", "ФОЛ_220_Тихорецк-ЕяТяговая");
        mapPo.put("57", "ФОЛ_220_Сальск-Песч");
        mapPo.put("58", "ФОЛ_220_ЕяТяговая-Песч");
        mapPo.put("59", "ФОЛ_330_Южная-Харцызская");
        mapPo.put("60", "ФОЛ_330_Южная-Ростов");
        return mapPo;
    }
    public static TreeMap<String, String> getMapTs(String schemesGroup){
        TreeMap<String, String> mapFormTs = new TreeMap<>();
        switch (schemesGroup) {
            case "{ВР}":
                mapFormTs.put("3", "Шунт_Волг-Рост_Вывед_ПО3");
                mapFormTs.put("12", "Шунт_Волг-Рост_Вывед_ПО12");
                mapFormTs.put("4", "Шунт_Волг-Рост_Вывед_ПО4");
                mapFormTs.put("36", "Шунт_Волг-Рост_Вывед_ПО36");
                mapFormTs.put("37", "Шунт_Волг-Рост_Вывед_ПО37");
                mapFormTs.put("38", "Шунт_Волг-Рост_Вывед_ПО38");
                mapFormTs.put("39", "Шунт_Волг-Рост_Вывед_ПО39");
                mapFormTs.put("40", "Шунт_Волг-Рост_Вывед_ПО40");
                mapFormTs.put("27", "Шунт_Волг-Рост_Вывед_ПО27");
                mapFormTs.put("28", "Шунт_Волг-Рост_Вывед_ПО28");
                mapFormTs.put("29", "Шунт_Волг-Рост_Вывед_ПО29");
                mapFormTs.put("41", "Шунт_Волг-Рост_Вывед_ПО41");
                mapFormTs.put("30", "Шунт_Волг-Рост_Вывед_ПО30");
                mapFormTs.put("31", "Шунт_Волг-Рост_Вывед_ПО31");
                mapFormTs.put("32", "Шунт_Волг-Рост_Вывед_ПО32");
                mapFormTs.put("33", "Шунт_Волг-Рост_Вывед_ПО33");
                mapFormTs.put("34", "Шунт_Волг-Рост_Вывед_ПО34");
                mapFormTs.put("35", "Шунт_Волг-Рост_Вывед_ПО35");
                mapFormTs.put("6", "Шунт_Волг-Рост_Вывед_ПО6");
                mapFormTs.put("8", "Шунт_Волг-Рост_Вывед_ПО8");
                mapFormTs.put("18", "Шунт_Волг-Рост_Вывед_ПО6_и_Р12");
                mapFormTs.put("24", "Шунт_Волг-Рост_Вывед_ПО8_и_Р90");
                break;
            case "{ВР_БЛ1}":
                mapFormTs.put("11", "Шунт_Волг-Рост+Б1_Вывед_ПО11");
                mapFormTs.put("48", "Шунт_Волг-Рост+Б1_Вывед_ПО48");
                break;
            case "{ВР_БЛ2}":
                mapFormTs.put("20", "Шунт_Волг-Рост+Б2_Вывед_ПО20");
                mapFormTs.put("49", "Шунт_Волг-Рост+Б2_Вывед_ПО49");
                break;
            case "{ВР_БЛ3}":
                mapFormTs.put("22", "Шунт_Волг-Рост+Б3_Вывед_ПО22");
                mapFormTs.put("28", "Шунт_Волг-Рост+Б3_Вывед_ПО28");
                mapFormTs.put("27", "Шунт_Волг-Рост+Б3_Вывед_ПО27");
                mapFormTs.put("50", "Шунт_Волг-Рост+Б3_Вывед_ПО50");
                mapFormTs.put("51", "Шунт_Волг-Рост+Б3_Вывед_ПО51");
                break;
            case "{ВР_БЛ4}":
                mapFormTs.put("23", "Шунт_Волг-Рост+Б4_Вывед_ПО23");
                mapFormTs.put("28", "Шунт_Волг-Рост+Б4_Вывед_ПО28");
                mapFormTs.put("27", "Шунт_Волг-Рост+Б4_Вывед_ПО27");
                mapFormTs.put("52", "Шунт_Волг-Рост+Б4_Вывед_ПО52");
                mapFormTs.put("53", "Шунт_Волг-Рост+Б4_Вывед_ПО53");
                break;
            case "{РВ}":
                mapFormTs.put("3", "Шунт_Рост-Волг_Вывед_ПО3");
                mapFormTs.put("12", "Шунт_Рост-Волг_Вывед_ПО12");
                mapFormTs.put("4", "Шунт_Рост-Волг_Вывед_ПО4");
                mapFormTs.put("18", "Шунт_Рост-Волг_Вывед_ПО6_и_Р12");
                mapFormTs.put("24", "Шунт_Рост-Волг_Вывед_ПО8_и_Р90");
                mapFormTs.put("26", "Шунт_Рост-Волг_Вывед_ПО1_и_Р6");
                mapFormTs.put("25", "Шунт_Рост-Волг_Вывед_ПО14_и_Р1");
                mapFormTs.put("36", "Шунт_Рост-Волг_Вывед_ПО36");
                mapFormTs.put("37", "Шунт_Рост-Волг_Вывед_ПО37");
                mapFormTs.put("38", "Шунт_Рост-Волг_Вывед_ПО38");
                mapFormTs.put("39", "Шунт_Рост-Волг_Вывед_ПО39");
                mapFormTs.put("40", "Шунт_Рост-Волг_Вывед_ПО40");
                mapFormTs.put("27", "Шунт_Рост-Волг_Вывед_ПО27");
                mapFormTs.put("28", "Шунт_Рост-Волг_Вывед_ПО28");
                mapFormTs.put("29", "Шунт_Рост-Волг_Вывед_ПО29");
                mapFormTs.put("41", "Шунт_Рост-Волг_Вывед_ПО41");
                mapFormTs.put("30", "Шунт_Рост-Волг_Вывед_ПО30");
                mapFormTs.put("31", "Шунт_Рост-Волг_Вывед_ПО31");
                mapFormTs.put("32", "Шунт_Рост-Волг_Вывед_ПО32");
                mapFormTs.put("33", "Шунт_Рост-Волг_Вывед_ПО33");
                mapFormTs.put("34", "Шунт_Рост-Волг_Вывед_ПО34");
                mapFormTs.put("14", "Шунт_Рост-Волг_Вывед_ПО14");
                mapFormTs.put("35", "Шунт_Рост-Волг_Вывед_ПО35");
                mapFormTs.put("6", "Шунт_Рост-Волг_Вывед_ПО6");
                mapFormTs.put("8", "Шунт_Рост-Волг_Вывед_ПО8");
                break;
            case "{РВ_ПШ}":
                mapFormTs.put("5", "Шунт_Рост-Волг+П-Ш_Вывед_ПО5");
                mapFormTs.put("29", "Шунт_Рост-Волг+П-Ш_Вывед_ПО29");
                break;
            case "{В_БЛ1}":
                mapFormTs.put("11", "Шунт_Волг-е+Б1_Вывед_ПО11");
                break;
            case "{В_БЛ2}":
                mapFormTs.put("20", "Шунт_Волг-е+Б2_Вывед_ПО20");
                break;
            case "{В_БЛ3}":
                mapFormTs.put("22", "Шунт_Волг-е+Б3_Вывед_ПО22");
                break;
            case "{В_БЛ4}":
                mapFormTs.put("23", "Шунт_Волг-е+Б4_Вывед_ПО23");
                break;
            case "{Ф_БЛ1}":
                mapFormTs.put("11", "Шунт_Фрол-е+Б1_Вывед_ПО11");
                break;
            case "{Ф_БЛ2}":
                mapFormTs.put("20", "Шунт_Фрол-е+Б2_Вывед_ПО20");
                break;
            case "{Ф_БЛ3}":
                mapFormTs.put("22", "Шунт_Фрол-е+Б3_Вывед_ПО22");
                break;
            case "{Ф_БЛ4}":
                mapFormTs.put("23", "Шунт_Фрол-е+Б4_Вывед_ПО23");
                break;
            case "{В_ПШ}":
                mapFormTs.put("5", "Шунт_Волг-е_изЭСЮга+ПШ_Вывед_ПО5");
                break;
            case "{Ф_ПШ}":
                mapFormTs.put("5", "Шунт_Фрол-е_изЭСЮга+ПШ_Вывед_ПО5");
                break;
            case "{С}":
                mapFormTs.put("3", "Шунт_Север_Вывед_ПО3");
                mapFormTs.put("2", "Шунт_Север_Вывед_ПО2");
                mapFormTs.put("1", "Шунт_Север_Вывед_ПО1");
                mapFormTs.put("12", "Шунт_Север_Вывед_ПО12");
                mapFormTs.put("10", "Шунт_Север_Вывед_ПО10");
                mapFormTs.put("27", "Шунт_Север_Вывед_ПО27");
                mapFormTs.put("28", "Шунт_Север_Вывед_ПО28");
                mapFormTs.put("7", "Шунт_Север_Вывед_ПО7");
                mapFormTs.put("55", "Шунт_Север_Вывед_ПО55");
                mapFormTs.put("13", "Шунт_Север_Вывед_ПО13");
                mapFormTs.put("56", "Шунт_Север_Вывед_ПО56");
                mapFormTs.put("57", "Шунт_Север_Вывед_ПО57");
                mapFormTs.put("58", "Шунт_Север_Вывед_ПО58");
                break;
            case "{Ш}":
                mapFormTs.put("13", "Шунт_Шахты_Вывед_ПО13");
                mapFormTs.put("2", "Шунт_Шахты_Вывед_ПО2");
                mapFormTs.put("1", "Шунт_Шахты_Вывед_ПО1");
                mapFormTs.put("4", "Шунт_Шахты_Вывед_ПО4");
                mapFormTs.put("7", "Шунт_Шахты_Вывед_ПО7");
                mapFormTs.put("14", "Шунт_Шахты_Вывед_ПО14");
                mapFormTs.put("17", "Шунт_Шахты_Вывед_ПО17");
                mapFormTs.put("40", "Шунт_Шахты_Вывед_ПО40");
                mapFormTs.put("27", "Шунт_Шахты_Вывед_ПО27");
                mapFormTs.put("28", "Шунт_Шахты_Вывед_ПО28");
                mapFormTs.put("18", "Шунт_Рост-Волг_Вывед_ПО6_и_Р12");
                mapFormTs.put("24", "Шунт_Волг-Рост_Вывед_ПО8_и_Р90");
                mapFormTs.put("29", "Шунт_Шахты_Вывед_ПО29");
                mapFormTs.put("54", "Шунт_Шахты_Вывед_ПО54");
                mapFormTs.put("23", "Шунт_Шахты_Вывед_ПО23");
                mapFormTs.put("8", "Шунт_Шахты_Вывед_ПО8");
                mapFormTs.put("6", "Шунт_Шахты_Вывед_ПО6");
                break;
            case "{ВР_БЛ12}":
                mapFormTs.put("42", "Шунт_Волг-Рост+Б1+Б2_Вывед_ПО42");
                break;
            case "{ВР_БЛ13}":
                mapFormTs.put("43", "Шунт_Волг-Рост+Б1+Б3_Вывед_ПО43");
                break;
            case "{ВР_БЛ23}":
                mapFormTs.put("44", "Шунт_Волг-Рост+Б2+Б3_Вывед_ПО44");
                break;
            case "{ВР_БЛ14}":
                mapFormTs.put("45", "Шунт_Волг-Рост+Б1+Б4_Вывед_ПО45");
                break;
            case "{ВР_БЛ24}":
                mapFormTs.put("46", "Шунт_Волг-Рост+Б2+Б4_Вывед_ПО46");
                break;
            case "{ВР_БЛ34}":
                mapFormTs.put("47", "Шунт_Волг-Рост+Б3+Б4_Вывед_ПО47");
                break;
            case "{В_БЛ12}":
                mapFormTs.put("42", "Шунт_Волг+Б1+Б2_Вывед_ПО42");
                break;
            case "{В_БЛ13}":
                mapFormTs.put("43", "Шунт_Волг+Б1+Б3_Вывед_ПО43");
                break;
            case "{В_БЛ23}":
                mapFormTs.put("44", "Шунт_Волг+Б2+Б3_Вывед_ПО44");
                break;
            case "{В_БЛ14}":
                mapFormTs.put("45", "Шунт_Волг+Б1+Б4_Вывед_ПО45");
                break;
            case "{В_БЛ24}":
                mapFormTs.put("46", "Шунт_Волг+Б2+Б4_Вывед_ПО46");
                break;
            case "{В_БЛ34}":
                mapFormTs.put("47", "Шунт_Волг+Б3+Б4_Вывед_ПО47");
                break;
            case "{Ф_БЛ12}":
                mapFormTs.put("42", "Шунт_Фрол+Б1+Б2_Вывед_ПО42");
                break;
            case "{Ф_БЛ13}":
                mapFormTs.put("43", "Шунт_Фрол+Б1+Б3_Вывед_ПО43");
                break;
            case "{Ф_БЛ23}":
                mapFormTs.put("44", "Шунт_Фрол+Б2+Б3_Вывед_ПО44");
                break;
            case "{Ф_БЛ14}":
                mapFormTs.put("45", "Шунт_Фрол+Б1+Б4_Вывед_ПО45");
                break;
            case "{Ф_БЛ24}":
                mapFormTs.put("46", "Шунт_Фрол+Б2+Б4_Вывед_ПО46");
                break;
            case "{Ф_БЛ34}":
                mapFormTs.put("47", "Шунт_Фрол+Б3+Б4_Вывед_ПО47");
                break;
        }
        return mapFormTs;
    }
    public static String createTableString(String schemesGroup, String sezonGroup,Row row, String keyNameScheme, String schemesKpr){
        System.out.println(schemesGroup);
        System.out.println(row.getCell(1).getCellType());
        Cell cell = row.getCell(1);
        String blockCount ="";
        if (cell.getCellType()== CellType.NUMERIC){
            blockCount= Integer.toString((int) cell.getNumericCellValue());
        }else if (cell.getCellType()==CellType.STRING){
            blockCount = cell.getStringCellValue();
        }
        String formulaBlock;

        switch (blockCount) {
            case "4":
                formulaBlock = "В_работе_4_блока_РоАЭС";
                break;
            case "3 и менее":
                formulaBlock = "В_работе_3_и_менее_блока_РоАЭС";
                break;
            default:
                formulaBlock = "";
                break;
        }
        Cell cell2 = row.getCell(2);
        String po="";
        if (cell2.getCellType()==CellType.NUMERIC){
            po = Integer.toString((int) cell2.getNumericCellValue());
        } else if (cell2.getCellType()==CellType.STRING) {
            po = cell2.getStringCellValue();
        }
        System.out.println(cell2.getCellType());
        System.out.println(po);
        keyMapTs = getMapTs(schemesGroup);
        String tsTableString = keyMapTs.get(po);
        System.out.println(tsTableString);
        String boolFormula;
        if (formulaBlock.isEmpty()){
            boolFormula ="["+sezonGroup+ "]";
        }else {
            boolFormula ="["+formulaBlock+"&"+sezonGroup+ "]";
        }
        String poString=keyMapPo.get(po);
        StringBuilder tableString = new StringBuilder();
        if (schemesGroup.equals("{С}")){
            tableString.append(String.join(" ", keyNameScheme, tsTableString, boolFormula, poString,"КПР_Север", schemesKpr));
        } else if (schemesGroup.equals("{Ш}")) {
            tableString.append(String.join(" ", keyNameScheme, tsTableString, boolFormula, poString,"КПР_Шахты", schemesKpr));
        }else {
            tableString = new StringBuilder(String.join(" ", keyNameScheme, tsTableString, boolFormula, poString, schemesKpr, "[безКпрДоз]"));
        }
        for (int i =4; i< row.getLastCellNum(); i++){
            Cell cell1 = row.getCell(i);
            String uv= "";
            if (cell1.getCellType()==CellType.NUMERIC){
                uv = Integer.toString((int) cell1.getNumericCellValue());
            } else if (cell1.getCellType()==CellType.STRING) {
                uv = cell1.getStringCellValue();

            }
            if (uv.equals("0")||uv.equals("")){
                tableString.append(" []");
            }else {
                tableString.append(" ").append(keyMapUv.get(uv));
            }
        }
        System.out.println(tableString);
        return tableString.toString();
    }
}
